OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
        case SPIM_BITMODE_1:
        default:
            SPIM_ENABLE_SING_OUTPUT_MODE(spim);     /* 1-bit, Output. */
            break;
    }
}

/**
 * @brief    Switch SPIM input to the specified bit mode.
 * @param[in]  spim     Pointer to the SPIM peripheral.
 * @param[in]  u32NBit  Bit width to set for input mode.
 *                      - \ref SPIM_BITMODE_1 : 1-bit mode
 *                      - \ref SPIM_BITMODE_2 : 2-bit mode (dual)
 *                      - \ref SPIM_BITMODE_4 : 4-bit mode (quad)
 *                      - \ref SPIM_BITMODE_8 : 8-bit mode (octal)
 * @return     None
 */
void SPIM_SwitchNBitInput(SPIM_T *spim, uint32_t u32NBit)
{
    switch (u32NBit)
    {
        case SPIM_BITMODE_2:
            SPIM_ENABLE_DUAL_INPUT_MODE(spim);      /* 2-bit, Input.  */
            break;

        case SPIM_BITMODE_4:
            SPIM_ENABLE_QUAD_INPUT_MODE(spim);      /* 4-bit, Input.  */
            break;

        case SPIM_BITMODE_8:
            SPIM_ENABLE_OCTAL_INPUT_MODE(spim);     /* 8-bit, Input.  */
            break;

        case SPIM_BITMODE_1:
        default:
            SPIM_ENABLE_SING_INPUT_MODE(spim);      /* 1-bit, Input.  */
            break;
    }
}

/**
 * @brief      Set SPIM clock divider to 16 and RX clock delay number to 0.
 *             This configuration is used for SPI Flash read/write operations.
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[in]  u32Restore  Enable or disable restoring the original SPIM clock divider
 *                         and RX clock delay number after operation.
 *                         - \ref SPIM_OP_ENABLE
 *                         - \ref SPIM_OP_DISABLE
 * @return     None
 */
static void SPIM_SetupConfigRegDiv(SPIM_T *spim, uint32_t u32Restore)
{
    int i32Idx = ((spim == SPIM0) ? 0 : 0);
    SPIM_DIV_CTX *pCTX = NULL;

    if (i32Idx < 0 || i32Idx >= (int)(sizeof(g_sSPIMCtx) / sizeof(g_sSPIMCtx[0])))
    {
        SPIM_DBGMSG("Error: Unknown SPIM instance!\r\n");
        return;
    }

    pCTX = &g_sSPIMCtx[i32Idx];

    if (u32Restore)
    {
        if (pCTX->u32Saved)
        {
            SPIM_SET_CLOCK_DIVIDER(spim, pCTX->u32Div);
            SPIM_SET_RXCLKDLY_RDDLYSEL(spim, pCTX->u32RxClkDly);
            SPIM_DBGMSG("SPIM%d restored: DIV=%u, RXDLY=%u\r\n", i32Idx, pCTX->u32Div, pCTX->u32RxClkDly);
            pCTX->u32Saved = 0;
        }
    }
    else
    {
        if (!pCTX->u32Saved)
        {
            pCTX->u32Div      = SPIM_GET_CLOCK_DIVIDER(spim);
            pCTX->u32RxClkDly = SPIM_GET_RXCLKDLY_RDDLYSEL(spim);
            pCTX->u32Saved    = 1;
            SPIM_DBGMSG("SPIM%d saved: DIV=%u, RXDLY=%u\r\n", i32Idx, pCTX->u32Div, pCTX->u32RxClkDly);
        }

        SPIM_SET_CLOCK_DIVIDER(spim, 16);
        SPIM_SET_RXCLKDLY_RDDLYSEL(spim, 0);
    }
}

/**
 * @brief      Write data to SPI slave in specified bit mode.
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[in]  pu8TxBuf    Pointer to the transmit buffer.
 * @param[in]  u32NTx      Number of bytes to transmit.
 * @param[in]  u32NBit     Bit mode for data transmission.
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @retval     SPIM_OK             Write operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT    Write operation failed due to timeout.
 */
static int32_t _SPIM_WriteData(SPIM_T *spim, uint8_t *pu8TxBuf, uint32_t u32NTx, uint32_t u32NBit)
{
    /* Write data to TX FIFO */
    uint32_t u32BufIdx = 0UL;   /* Transmit buffer index */
    uint32_t u32i;              /* Loop index */
    uint32_t u32Tmp;            /* Temporary variable */
    uint32_t u32ChunkSize;      /* Data chunk size */
    uint32_t u32BurstSize;      /* Burst data number */

    /* Switch between N-bit output mode */
    SPIM_SwitchNBitOutput(spim, u32NBit);

    while (u32NTx)
    {
        /* Calculate the number of data to be transferred in one burst */
        u32ChunkSize = (u32NTx >= 16) ? 4UL :
                       (u32NTx >= 12) ? 3UL :
                       (u32NTx >= 8) ? 2UL :
                       (u32NTx >= 4) ? 1UL :
                       0UL;

        if (u32ChunkSize)
        {
            /* Transfer data in burst mode */
            u32i = u32ChunkSize;

            while (u32i)
            {
                memcpy(&u32Tmp, &pu8TxBuf[u32BufIdx], 4UL);
                u32i--;
                spim->TX[u32i] = u32Tmp;
                u32BufIdx += 4UL;
                u32NTx -= 4UL;
            }

            u32BurstSize = u32ChunkSize;
            u32ChunkSize = 4UL;
        }
        else
        {
            u32ChunkSize = u32NTx;
            /* Transfer data in single mode */
            memcpy(&u32Tmp, &pu8TxBuf[u32BufIdx], u32NTx);
            u32BurstSize = 1UL;
            u32NTx = 0UL;
            spim->TX[0] = u32Tmp;
        }

        /* Switch to Normal mode */
        SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);
        /* Set data width */
        SPIM_SET_DATA_WIDTH(spim, (u32ChunkSize * 8UL));
        /* Set burst data number */
        SPIM_SET_BURST_DATA(spim, u32BurstSize);

        /* Wait until transfer complete */
        if (SPIM_WaitOpDone(spim, SPIM_OP_ENABLE) != SPIM_OK)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    return SPIM_OK;
}

/**
 * @brief      Read data from SPI slave using the specified bit mode.
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[out] pu8RxBuf    Pointer to the receive buffer.
 * @param[in]  u32NRx      Number of bytes to receive.
 * @param[in]  u32NBit     Bit mode for SPI transmission/reception.
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @retval     SPIM_OK             Read operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT    Read operation aborted due to timeout.
 */
static int32_t _SPIM_ReadData(SPIM_T *spim, uint8_t *pu8RxBuf, uint32_t u32NRx, uint32_t u32NBit)
{
    /*
     * Read data in burst mode to improve performance.
     */
    uint32_t u32BufIdx = 0UL;       /* Buffer index */
    uint32_t u32Tmp = 0;            /* Temporary variable for storing received data */
    uint32_t u32ChunkSize = 0;      /* Number of data in one burst */
    uint32_t u32TmpChunkSize = 0;   /* Temporary value for chunk_size */
    uint32_t u32BurstSize = 0;      /* Number of data in one burst */

    /* Configure SPIM to use N-bit input */
    SPIM_SwitchNBitInput(spim, u32NBit);

