OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    while (u32NRx)
    {
        /* Determine the number of data to be read in one burst */
        u32ChunkSize = (u32NRx >= 16) ? 4UL : /* At least 16 bytes */
                       (u32NRx >= 12) ? 3UL : /* 12 <= N < 16 */
                       (u32NRx >= 8) ? 2UL : /* 8 <= N < 12 */
                       (u32NRx >= 4) ? 1UL : /* 4 <= N < 8 */
                       0UL; /* N < 4 */

        u32TmpChunkSize = u32ChunkSize;

        if (u32ChunkSize)
        {
            /*
             * At least 2 data to be read in one burst, set burst size to
             * chunk_size.
             */
            u32BurstSize = u32ChunkSize;
            u32ChunkSize = 4UL;
        }
        else
        {
            /*
             * 1 data to be read, set burst size to 1 to read the data.
             */
            u32ChunkSize = u32NRx;
            u32BurstSize = 1UL;
        }

        /* Configure SPIM to use Normal mode, N-bit data width and burst size */
        SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);
        SPIM_SET_DATA_WIDTH(spim, (u32ChunkSize * 8UL));
        SPIM_SET_BURST_DATA(spim, u32BurstSize);

        /* Wait until transfer complete */
        if (SPIM_WaitOpDone(spim, SPIM_OP_ENABLE) != SPIM_OK)
        {
            return SPIM_ERR_TIMEOUT;
        }

        u32ChunkSize = u32TmpChunkSize;

        /* Read received data */
        if (u32ChunkSize >= 2UL)
        {
            /* Read multiple data in one burst */
            while (u32ChunkSize)
            {
                u32Tmp = spim->RX[u32ChunkSize - 1UL];
                memcpy(&pu8RxBuf[u32BufIdx], &u32Tmp, 4UL);
                u32ChunkSize--;
                u32BufIdx += 4UL;
                u32NRx -= 4UL;
            }
        }
        else
        {
            /* Read 1 data */
            u32Tmp = spim->RX[0];
            memcpy(&pu8RxBuf[u32BufIdx], &u32Tmp, u32NRx);
            u32BufIdx += u32NRx;
            u32NRx = 0UL;
        }
    }

    return SPIM_OK;
}

/**
 * @brief      Issue the "Read Status Register #1" command to the SPI Flash.
 * @param[out] pu8DataBuf  Pointer to the buffer to store the received status register data.
 * @param[in]  u32NRx      Number of bytes to receive.
 * @param[in]  u32NBit     Bit mode for SPI transmission/reception.
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @return     None
 */
void SPIM_ReadStatusRegister(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit)
{
    /* 1-byte Read Status Register #1 command. */
    uint8_t au8CmdBuf[2] = {OPCODE_RDSR, OPCODE_RDSR};

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    SPIM_IO_SendDummyByPhase(spim, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 8 : 0);

    _SPIM_ReadData(spim, pu8DataBuf, u32NRx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Issue the "Write Status Register #1" command to the SPI Flash.
 * @param[in]  pu8DataBuf  Pointer to the buffer containing data to be written.
 * @param[in]  u32NTx      Number of bytes to transmit.
 * @param[in]  u32NBit     Bit mode for SPI transmission.
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @return     None
 */
static void _SPIM_WriteStatusRegister(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NTx, uint32_t u32NBit)
{
    /* 1-byte Write Status Register #1 command + 1-byte data. */
    uint8_t au8CmdBuf[4] = {OPCODE_WRSR, 0x00U, 0x00U, 0x00U};

    au8CmdBuf[1] = (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? au8CmdBuf[0] : pu8DataBuf[0];
    au8CmdBuf[3] = au8CmdBuf[2] = pu8DataBuf[0];

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    u32NTx = ((SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 4UL : 2UL);
    _SPIM_WriteData(spim, au8CmdBuf, u32NTx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Issue the "Read Status Register #2" command.
 *
 * @param[in]  spim        Pointer to the SPIM instance.
 * @param[out] pu8DataBuf  Pointer to the buffer to store the received status register data.
 * @param[in]  u32NRx      Number of bytes to receive.
 * @param[in]  u32NBit     Bit mode used for the command and data transfer.
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit mode (Dual)
 *                         - \ref SPIM_BITMODE_4 : 4-bit mode (Quad)
 *                         - \ref SPIM_BITMODE_8 : 8-bit mode (Octal)
 *
 * @return     None
 */
static void _SPIM_ReadStatusRegister2(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit)
{
    /* 1-byte Read Status Register #1 command. */
    uint8_t au8CmdBuf[2] = {OPCODE_RDSR2, OPCODE_RDSR2};

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    SPIM_IO_SendDummyByPhase(spim, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 8UL : 0UL);

    _SPIM_ReadData(spim, pu8DataBuf, u32NRx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Issue the Winbond "Write Status Register" command.
 *
 * @param[in]  spim        Pointer to the SPIM peripheral instance.
 * @param[in]  pu8DataBuf  Pointer to the transmit buffer containing the status register values to write.
 * @param[in]  u32NTx      Number of bytes to transmit.
 * @param[in]  u32NBit     Bit mode used for command and data transfer:
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @return     None
 */
static void _SPIM_WriteStatusRegister2(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NTx, uint32_t u32NBit)
{
    uint8_t au8CmdBuf[6] = {OPCODE_WRSR, 0U, 0U};
    uint8_t u8DTREn = SPIM_GET_DTR_MODE(spim);

