OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    au8CmdBuf[1] = (u8DTREn == SPIM_OP_ENABLE) ? pu8DataBuf[0] : au8CmdBuf[0];
    au8CmdBuf[2] = (u8DTREn == SPIM_OP_ENABLE) ? pu8DataBuf[0] : pu8DataBuf[1];
    au8CmdBuf[3] = (u8DTREn == SPIM_OP_ENABLE) ? pu8DataBuf[0] : pu8DataBuf[1];
    au8CmdBuf[4] = pu8DataBuf[1];
    au8CmdBuf[5] = pu8DataBuf[1];

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    u32NTx = (u8DTREn == SPIM_OP_ENABLE) ? 6UL : 3UL;
    _SPIM_WriteData(spim, au8CmdBuf, u32NTx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

#if 0  /* not used */
/**
 * @brief      Issue the "Write Status Register #3" command.
 *
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[in]  pu8DataBuf  Pointer to the transmit buffer containing the data to write to Status Register #3.
 * @param[in]  u32NTx      Number of bytes to transmit.
 * @param[in]  u32NBit     Bit mode used for command and data transfer:
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @return     None
 */
static void SPIM_WriteStatusRegister3(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NTx, uint32_t u32NBit)
{
    uint8_t au8CmdBuf[] = {OPCODE_WRSR3, 0x00U};    /* 1-byte Write Status Register #2 command + 1-byte data. */
    au8CmdBuf[1] = pu8DataBuf[0];

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);        /* CS activated. */

    _SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), u32NBit);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);        /* CS deactivated. */
}
#endif

/**
 * @brief      Issue the "Read Configuration Register #3" command.
 *
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[out] pu8DataBuf  Pointer to the receive buffer for the configuration register data.
 * @param[in]  u32NRx      Number of bytes to receive.
 * @param[in]  u32NBit     Bit mode used for transmit/receive:
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @return     None
 */
static void _SPIM_ReadStatusRegister3(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit)
{
    /* 1-byte Read Status Register #1 command. */
    uint8_t au8CmdBuf[2] = {OPCODE_RDSR3, OPCODE_RDSR3};

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);
    SPIM_IO_SendDummyByPhase(spim, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 8UL : 0UL);

    _SPIM_ReadData(spim, pu8DataBuf, u32NRx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

#if 0  /* not used */
/**
 * @brief      Issue the "Write Security Register" command.
 *
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[in]  pu8DataBuf  Pointer to the transmit buffer containing the data to write.
 * @param[in]  u32NTx      Number of bytes to transmit.
 * @param[in]  u32NBit     Bit mode used for transmit/receive:
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @return     None
 */
static void SPIM_WriteSecurityRegister(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NTx, uint32_t u32NBit)
{
    /* 1-byte Write Status Register #2 command + 1-byte data. */
    uint8_t au8CmdBuf[] = {OPCODE_WRSCUR, 0x00U};

    au8CmdBuf[1] = pu8DataBuf[0];

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);
}
#endif

/**
 * @brief      Issue the "Read Security Register" command.
 *
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[out] pu8DataBuf  Pointer to the receive buffer for storing the security register data.
 * @param[in]  u32NRx      Number of bytes to receive.
 * @param[in]  u32NBit     Bit mode used for transmit/receive:
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @return     None
 */
static void _SPIM_ReadSecurityRegister(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit)
{
    /* 1-byte Read Status Register #1 command. */
    uint8_t au8CmdBuf[2] = {OPCODE_RDSCUR, OPCODE_RDSCUR};

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    SPIM_IO_SendDummyByPhase(spim, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 8UL : 0UL);

    _SPIM_ReadData(spim, pu8DataBuf, u32NRx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Issue the "Read Flag Status Register" command for Micron MT35X Octal SPI Flash.
 *
 * @param[in]  spim        Pointer to the SPIM peripheral instance.
 * @param[out] pu8DataBuf  Pointer to the receive buffer for storing the FSR data.
 * @param[in]  u32NRx      Number of bytes to receive.
 * @param[in]  u32NBit     Bit mode used for transmit/receive:
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @return     None
 *
 * @note       This command is used to check the current status of internal operations,
 *             such as program or erase progress.
 */
static void _SPIM_ReadMT35xFlagRegister(SPIM_T *spim, uint8_t *pu8DataBuf,
                                        uint32_t u32NRx, uint32_t u32NBit)
{
    /* 1-byte Read Status Register #1 command. */
    uint8_t au8CmdBuf[2] = {OPCODE_MICRON_RD_FLG, OPCODE_MICRON_RD_FLG};

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    SPIM_IO_SendDummyByPhase(spim, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 8 : 0);

