OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    _SPIM_ReadData(spim, pu8DataBuf, u32NRx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Check whether the SPI Flash erase or write operation has completed.
 *
 * @param[in]  spim     Pointer to the SPIM peripheral instance.
 * @param[in]  u32NBit  Bit mode used for transmit/receive:
 *                      - \ref SPIM_BITMODE_1 : 1-bit mode
 *                      - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                      - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                      - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @retval     1        Operation completed (Ready).
 * @retval     0        Operation still in progress (Busy).
 *
 * @note       Typically checks the WIP (Write-In-Progress) bit in the Flash status register.
 */
static int _SPIM_IsWriteDone(SPIM_T *spim, uint32_t u32NBit)
{
    uint8_t au8Status[2] = {0};
    SPIM_ReadStatusRegister(spim, au8Status, sizeof(au8Status), u32NBit);
    return !(au8Status[0] & SR_WIP);
}

/**
 * @brief      Wait until the SPI Flash erase or write operation completes.
 *
 * @param[in]  spim     Pointer to the SPIM peripheral instance.
 * @param[in]  u32NBit  Bit mode used for transmit/receive:
 *                      - \ref SPIM_BITMODE_1 : 1-bit mode
 *                      - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                      - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                      - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @retval     SPIM_OK           Operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT  Operation timed out (erase/write did not complete in time).
 *
 * @note       This function typically polls the WIP (Write-In-Progress) bit in the SPI Flash
 *             Status Register until it is cleared, or until a timeout occurs.
 */
static int _SPIM_WaitWriteDone(SPIM_T *spim, uint32_t u32NBit)
{
    volatile uint32_t u32Count;
    int i32Ret = (int32_t)SPIM_ERR_FAIL;

    for (u32Count = 0UL; u32Count < SystemCoreClock / 1000UL; u32Count++)
    {
        if (_SPIM_IsWriteDone(spim, u32NBit))
        {
            i32Ret = SPIM_OK;
            break;
        }
    }

    if (i32Ret != SPIM_OK)
    {
        SPIM_DBGMSG("spim_wait_write_done time-out!!\n");
    }

    return i32Ret;
}

/**
 * @brief      Wait for the SPIM operation to complete and optionally check the busy status.
 *
 * @param[in]  spim       Pointer to the SPIM peripheral instance.
 * @param[in]  u32IsSync  Specify whether to wait until the operation completes:
 *                        - 0 : Do not wait (asynchronous mode).
 *                        - 1 : Wait for the busy flag to clear (synchronous mode).
 *
 * @retval     SPIM_OK           Operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT  Operation failed due to timeout.
 *
 * @note       This function checks the busy status of the SPIM controller. If @p u32IsSync is set,
 *             it will poll the busy flag until cleared or timeout occurs.
 */
int32_t SPIM_WaitOpDone(SPIM_T *spim, uint32_t u32IsSync)
{
    volatile int32_t i32TimeOutCount = (int32_t)SPIM_TIMEOUT;

    /* Trigger SPIM operation. */
    SPIM_SET_GO(spim);

    if (u32IsSync)
    {
        /* Wait Busy Status. */
        while (SPIM_IS_BUSY(spim))
        {
            if (--i32TimeOutCount <= 0)
            {
                /* Time-out, return failed. */
                return SPIM_ERR_TIMEOUT;
            }
        }
    }

    return SPIM_OK;
}

/**
 * @brief      Issues a Write Enable or Write Disable command to the SPI Flash device.
 *
 * @param[in]  spim      Pointer to the SPIM peripheral instance.
 * @param[in]  i32IsEn   Specify whether to enable or disable write operations:
 *                       - \ref SPIM_OP_ENABLE : Send Write Enable command (e.g., 0x06)
 *                       - \ref SPIM_OP_DISABLE: Send Write Disable command (e.g., 0x04)
 * @param[in]  u32NBit   SPI bus I/O width (bit mode):
 *                       - \ref SPIM_BITMODE_1 : 1-bit mode
 *                       - \ref SPIM_BITMODE_2 : 2-bit mode
 *                       - \ref SPIM_BITMODE_4 : 4-bit mode
 *                       - \ref SPIM_BITMODE_8 : 8-bit mode
 *
 * @return     None.
 *
 * @note       This command is typically required before performing write, erase, or security register operations.
 */
void SPIM_SetWriteEnable(SPIM_T *spim, int32_t i32IsEn, uint32_t u32NBit)
{
    /* 1-byte Write Enable command. */
    uint8_t au8CmdBuf[2] = {0U};
    au8CmdBuf[0] = au8CmdBuf[1] = (i32IsEn ? OPCODE_WREN : OPCODE_WRDI);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated.   */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    /* CS deactivated.  */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Enable or disable Wrap Around mode on the SPI Flash.
 *
 * @param[in]  spim    Pointer to the SPIM peripheral instance.
 * @param[in]  i32IsEn Specify whether to enable or disable Wrap mode:
 *                     - \ref SPIM_OP_ENABLE  : Enable Wrap Around mode
 *                     - \ref SPIM_OP_DISABLE : Disable Wrap Around mode
 *
 * @retval     SPIM_OK          Operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT Operation aborted due to timeout.
 *
 * @note       Wrap Around mode is commonly used to optimize burst read performance
 *             by allowing continuous read within a fixed-length boundary.
 */
int32_t SPIM_SetWrapAroundEnable(SPIM_T *spim, int32_t i32IsEn)
{
    uint32_t u32CmdBuf[2] = {0x00000000, 0x11011101};

    SPIM_SetQuadEnable(spim, SPIM_OP_ENABLE, SPIM_BITMODE_1);

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    spim->TX[0] = (i32IsEn == SPIM_OP_ENABLE) ?
                  (u32CmdBuf[0] | (1 << 29)) :
                  (u32CmdBuf[0] | (1 << 28));
    spim->TX[1] = 0x11011101;

    SPIM_SwitchNBitOutput(spim, SPIM_BITMODE_4);

    /* Switch to Normal mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);

    SPIM_SET_DATA_WIDTH(spim, 32UL);
    SPIM_SET_BURST_DATA(spim, 2UL);

    SPIM_WaitOpDone(spim, SPIM_OP_ENABLE);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetQuadEnable(spim, SPIM_OP_DISABLE, SPIM_BITMODE_1);

    return SPIM_OK;
}

/**
 * @brief      Issue the command to exit continuous read mode on SPI Flash.
 *
 * @param[in]  spim    Pointer to the SPIM peripheral instance.
 *
 * @retval     0                  Operation completed successfully.
 * @retval     negative value     Operation failed (e.g., due to timeout or invalid configuration).
 *
 * @note       Some SPI Flash devices (e.g., Winbond, Macronix) enter continuous read mode after
 *             specific fast-read commands. This function sends a termination sequence (usually
 *             dummy clocks or specific exit command) to revert back to standby command mode.
 *
 * @note       Refer to the specific flash datasheet to determine if this operation is required.
 */
static int32_t _SPIM_SetContReadDisable(SPIM_T *spim)
{
    SPIM_SetQuadEnable(spim, SPIM_OP_ENABLE, SPIM_BITMODE_1);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    spim->TX[0] = 0xFFFFFFFF;

    /* Quad output mode */
    SPIM_SwitchNBitOutput(spim, SPIM_BITMODE_4);

