OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    /* Switch to normal mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);
    SPIM_SET_DATA_WIDTH(spim, 32UL);
    SPIM_SET_BURST_DATA(spim, 1UL);

    SPIM_WaitOpDone(spim, SPIM_OP_ENABLE);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetQuadEnable(spim, SPIM_OP_DISABLE, SPIM_BITMODE_1);

    _SPIM_ClearContReadPhase(spim, SPIM_CTL0_OPMODE_DIRECTMAP);

    return SPIM_OK;
}

/** @endcond HIDDEN_SYMBOLS */

/**
 * @brief      Exit Infineon Octal I/O (OPI) mode and revert to legacy 1S-1S-1S SPI mode.

 * @param[in]  spim     Pointer to the SPIM peripheral instance.
 *
 * @note       After this operation, all future communication with the flash device should use
 *             standard SPI commands. Make sure the controller SPI configuration is reverted
 *             accordingly (e.g., bit width, clock polarity).
 */
void SPIM_ExitOPIMode_IFX(SPIM_T *spim)
{
    uint8_t u8CFR5Buf = 0xFF;
    volatile int i32Delay = 0;

    // === Phase A: Try accessing CFR5V using Octal DDR (8D-8D-8D) ===
    SPIM_PHASE_T sPhase8D =
    {
        .u32CMDCode = OPCODE_IFX_RD_VCR,
        .u32CMDPhase = PHASE_OCTAL_MODE, .u32CMDWidth = PHASE_WIDTH_8, .u32CMDDTR = PHASE_ENABLE_DTR,
        .u32AddrPhase = PHASE_OCTAL_MODE, .u32AddrWidth = PHASE_WIDTH_32, .u32AddrDTR = PHASE_ENABLE_DTR,
        .u32DataPhase = PHASE_OCTAL_MODE, .u32ByteOrder = PHASE_ORDER_MODE0, .u32DataDTR = PHASE_ENABLE_DTR,
        .u32RDQS = SPIM_OP_DISABLE, .u32DcNum = 8
    };
    SPIM_PHASE_T sWrite8D = sPhase8D;
    SPIM_PHASE_T sPhase8S = {0};
    SPIM_PHASE_T sWrite8S = {0};

    sWrite8D.u32CMDCode = OPCODE_IFX_WR_VCR;
    sWrite8D.u32DcNum = 0;

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);
    SPIM_IO_ReadByPhase(spim, &sPhase8D, IFX_CFR5_ADDR, &u8CFR5Buf, 1);

    if (u8CFR5Buf != 0xFF && u8CFR5Buf != 0x00)
    {
        u8CFR5Buf &= ~0x03;
        SPIM_IO_WriteByPhase(spim, &sWrite8D, IFX_CFR5_ADDR, &u8CFR5Buf, 1, SPIM_OP_DISABLE);
    }

    // === Phase B: Try accessing CFR5V using Octal SDR (8S-8S-8S) ===
    u8CFR5Buf = 0xFF;
    sPhase8S = sPhase8D;
    sPhase8S.u32CMDDTR = PHASE_DISABLE_DTR;
    sPhase8S.u32AddrDTR = PHASE_DISABLE_DTR;
    sPhase8S.u32DataDTR = PHASE_DISABLE_DTR;
    sPhase8S.u32DcNum = 0;

    sWrite8S = sPhase8S;
    sWrite8S.u32CMDCode = OPCODE_IFX_WR_VCR;

    SPIM_IO_ReadByPhase(spim, &sPhase8S, IFX_CFR5_ADDR, &u8CFR5Buf, 1);

    if (u8CFR5Buf != 0xFF && u8CFR5Buf != 0x00)
    {
        u8CFR5Buf &= ~0x03;
        SPIM_IO_WriteByPhase(spim, &sWrite8S, IFX_CFR5_ADDR, &u8CFR5Buf, 1, SPIM_OP_DISABLE);
    }

    // === Phase C: Optional delay and hardware reset ===
    for (i32Delay = 0; i32Delay < 50000; i32Delay++) __NOP();

    SPIM_SET_RSTN_MODE(spim, SPIM_OP_ENABLE);

    for (i32Delay = 0; i32Delay < 50000; i32Delay++) __NOP();

    SPIM_SET_RSTN_MODE(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Enter Infineon Octal I/O (OPI) mode in SDR or DDR.
 *
 * @param[in]  spim       Pointer to the SPIM peripheral instance.
 * @param[in]  i32IsDDR   DDR mode flag.
 *                        - \ref SPIM_OP_DISABLE : Enter OPI SDR mode (8S-8S-8S)
 *                        - \ref SPIM_OP_ENABLE  : Enter OPI DDR mode (8D-8D-8D)
 * @return     None.
 *
 * @note       Before calling this function, ensure that the Write Enable (WREN) command is issued.
 * @note       After entering OPI mode, all subsequent commands must use the corresponding
 *             8-line I/O protocol (SDR or DDR) with appropriate bit width configuration.
 */
void SPIM_EnterOPIMode_IFX(SPIM_T *spim, int i32IsDDR)
{
    uint8_t u8CFR5Buf = 0;
    volatile int i32Delay = 0;

    // Phase setting for initial 1S-1S-1S
    SPIM_PHASE_T sCmdRead =
    {
        .u32CMDCode   = OPCODE_IFX_RD_VCR, // 0x65: Read Any Register
        .u32CMDPhase  = PHASE_NORMAL_MODE,
        .u32CMDWidth  = PHASE_WIDTH_8,
        .u32CMDDTR    = PHASE_DISABLE_DTR,

        .u32AddrPhase = PHASE_NORMAL_MODE,
        .u32AddrWidth = PHASE_WIDTH_24,
        .u32AddrDTR   = PHASE_DISABLE_DTR,

        .u32DataPhase = PHASE_NORMAL_MODE,
        .u32ByteOrder = PHASE_ORDER_MODE0,
        .u32DataDTR   = PHASE_DISABLE_DTR,

        .u32RDQS      = SPIM_OP_DISABLE,
        .u32DcNum     = 0,
    };

    // Clone for write
    SPIM_PHASE_T sCmdWrite = sCmdRead;
    sCmdWrite.u32CMDCode = OPCODE_IFX_WR_VCR;

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    // Step 1: Read CFR5V from 1S mode
    SPIM_IO_ReadByPhase(spim, &sCmdRead, IFX_CFR5_ADDR, &u8CFR5Buf, sizeof(u8CFR5Buf));

    // Step 2: Set OPI-IT (bit 0) and SDRDDR (bit 1)
    u8CFR5Buf |= 0x01; // OPI-IT = 1 Octal mode enable

    if (i32IsDDR)
        u8CFR5Buf |= 0x02; // SDRDDR = 1 DDR mode
    else
        u8CFR5Buf &= ~(0x02); // SDRDDR = 0 SDR mode

    // Step 3: Write back updated value
    SPIM_IO_WriteByPhase(spim, &sCmdWrite, IFX_CFR5_ADDR, &u8CFR5Buf, sizeof(u8CFR5Buf), SPIM_OP_DISABLE);

    // Step 4: Wait for mode switch to take effect
    for (i32Delay = 0; i32Delay < 50000; i32Delay++) __NOP();

    // Step 5: Update global DTR flag
    if (i32IsDDR)
        SPIM_SET_DTR_MODE(spim, SPIM_OP_ENABLE);
    else
        SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Exit Micron Octal I/O (OPI) mode and revert to 1S-1S-1S legacy SPI mode.
 *
 * @param[in]  spim     Pointer to the SPIM peripheral instance.
 *
 * @note       This operation typically requires a Write Enable (WREN) command beforehand.
 * @note       After exiting OPI mode, reconfigure SPIM controller to match legacy SPI timing and bit mode.
 */
void SPIM_ExitOPIMode_MICRON(SPIM_T *spim)
{
    uint8_t u8CMDBuf[1] = {OPCODE_MICRON_SDR_DQS};
    SPIM_PHASE_T sWrNVCRegCMD =
    {
        OPCODE_MICRON_WR_VCFG,                                                  //Command Code
        PHASE_OCTAL_MODE, PHASE_WIDTH_8, PHASE_ENABLE_DTR,                      //Command Phase
        PHASE_OCTAL_MODE, PHASE_WIDTH_32, PHASE_ENABLE_DTR,                     //Address Phase
        PHASE_OCTAL_MODE, PHASE_ORDER_MODE0, PHASE_ENABLE_DTR, SPIM_OP_ENABLE,  //Data Phase
        0,                                                                      //Dummy
        PHASE_DISABLE_CONT_READM, 0, 0, 0,                                      //Continue Phase
    };

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* Set non-volatile register exit octal DDR mode */
    SPIM_IO_WriteByPhase(spim, &sWrNVCRegCMD, 0x00, u8CMDBuf, sizeof(u8CMDBuf), SPIM_OP_DISABLE);

