OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);

    /* Disable 4-byte Address mode */
    SPIM_Enable_4Bytes_Mode(spim, SPIM_OP_DISABLE, SPIM_BITMODE_1);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Enter Micron Octal I/O (OPI) mode in either SDR or DDR.
 *
 * @param[in]  spim       Pointer to the SPIM peripheral instance.
 *
 * @note       A Write Enable (WREN) command is typically required before modifying VCR6.
 * @note       After enabling OPI mode, the SPIM controller must be reconfigured to match the selected
 *             OPI mode (DDR), including bit width, DQS, and dummy cycles.
 */
void SPIM_EnterOPIMode_MICRON(SPIM_T *spim)
{
    uint8_t u8CMDBuf[1] = {OPCODE_MICRON_OCTAL_DQS};
    SPIM_PHASE_T sWrNVCRegCMD =
    {
        OPCODE_MICRON_WR_VCFG,                                                      //Command Code
        PHASE_NORMAL_MODE, PHASE_WIDTH_8, PHASE_DISABLE_DTR,                        //Command Phase
        PHASE_NORMAL_MODE, PHASE_WIDTH_32, PHASE_DISABLE_DTR,                       //Address Phase
        PHASE_NORMAL_MODE, PHASE_ORDER_MODE0, PHASE_DISABLE_DTR, SPIM_OP_DISABLE,   //Data Phase
        0,
        PHASE_DISABLE_CONT_READM, 0, 0, 0,                                          //Continue Phase
    };

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* Enable 4-byte address mode */
    SPIM_Enable_4Bytes_Mode(spim, SPIM_OP_ENABLE, SPIM_BITMODE_1);
    SPIM_SET_4BYTE_ADDR(spim, SPIM_OP_ENABLE);

    /* Set non-volatile register enter octal DDR mode */
    SPIM_IO_WriteByPhase(spim, &sWrNVCRegCMD, 0x00, u8CMDBuf, sizeof(u8CMDBuf), SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);

    SPIM_SET_DTR_MODE(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Get the current SPIM serial clock frequency.
 *
 * @param[in]  spim    Pointer to the SPIM peripheral instance.
 *
 * @retval     uint32_t    SPI serial clock frequency in Hz.
 *
 * @note       Ensure the SPIM clock source and divider are properly configured before calling this function.
 */
uint32_t SPIM_GetSClkFreq(SPIM_T *spim)
{
    uint32_t u32ClkDiv = SPIM_GET_CLOCK_DIVIDER(spim);

    return u32ClkDiv ? SystemCoreClock / (u32ClkDiv * 2U) : SystemCoreClock;
}

/**
 * @brief      Resets the connected SPI Flash device via SPIM.
 *
 * @param[in]  spim      Pointer to the SPIM instance.
 * @param[in]  u32NBit   N-bit transfer mode.
 *                       - \ref SPIM_BITMODE_1 : Standard SPI (1-bit)
 *                       - \ref SPIM_BITMODE_2 : Dual SPI (2-bit)
 *                       - \ref SPIM_BITMODE_4 : Quad SPI (4-bit)
 *                       - \ref SPIM_BITMODE_8 : Octal SPI (8-bit)
 * @return     None
 *
 * @note       Some Flash chips (e.g., Winbond, Micron, ISSI, Macronix) require reset before switching modes (e.g., exiting OPI).
 * @note       Ensure the SPIM interface is initialized and the clock is stable before calling this function.
 */
static void _SPIM_ResetDevice(SPIM_T *spim, uint32_t u32NBit)
{
    uint8_t au8CmdBuf[2] = {0UL};

    /* Reset Enable */
    au8CmdBuf[0] = au8CmdBuf[1] = OPCODE_RSTEN;
    /* CS activated.    */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    /* CS deactivated.  */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    /* Reset */
    au8CmdBuf[0] = au8CmdBuf[1] = OPCODE_RST;
    /* CS activated.    */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    /* CS deactivated.  */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);
}

/**
 * @brief      Initialize the SPIM Flash interface and detect Flash device.
 *
 * @param[in]  spim     Pointer to the SPIM peripheral instance.
 * @param[in]  i32ClrWP Write Protection control:
 *                      - `1` : Attempt to clear Flash write protection bits (if supported).
 *                      - `0` : Leave current write protection setting unchanged.
 *
 * @retval     SPIM_OK          Initialization completed successfully.
 * @retval     SPIM_ERR_FAIL    Initialization failed, possibly due to:
 *                              - Unable to read Manufacturer ID.
 *                              - Unknown or unsupported Flash vendor/device.
 *
 * @note       This function should be called after SPIM controller and clock are initialized.
 * @note       Clearing write protection may require prior write enable and manufacturer-specific handling.
 * @note       Only common vendors such as Winbond, Micron, Macronix, ISSI, etc., may be supported.
 */
int32_t SPIM_InitFlash(SPIM_T *spim, int32_t i32ClrWP)
{
    uint8_t au8IdBuf[3];
    uint32_t u32i = 0;
    int32_t i32Ret = (int32_t)SPIM_ERR_FAIL;

    /* Enable SPI Flash Mode */
    SPIM_SET_FLASH_MODE(spim);

    /* Enable DLL */
    SPIM_INIT_DLL(spim);

    SPIM_SET_SS_ACTLVL(spim, SPIM_OP_DISABLE);

    SPIM_ExitOPIMode_IFX(spim);

    SPIM_ExitOPIMode_MICRON(spim);

    /*
     * Because not sure in SPI or QPI mode, do QPI reset and then SPI reset.
     */
    /* Quad Mode Reset */
    _SPIM_ResetDevice(spim, SPIM_BITMODE_4);

    /* Single Mode Reset */
    _SPIM_ResetDevice(spim, SPIM_BITMODE_1);

    if (i32ClrWP)
    {
        uint8_t dataBuf[] = {0x00U};

        /* Clear Block Protect. */
        SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, SPIM_BITMODE_1);

        _SPIM_WriteStatusRegister(spim, dataBuf, sizeof(dataBuf), SPIM_BITMODE_1);

        _SPIM_WaitWriteDone(spim, SPIM_BITMODE_1);
    }

    SPIM_ReadJedecId(spim, au8IdBuf, sizeof(au8IdBuf), SPIM_BITMODE_1);

    for (u32i = 0; u32i < sizeof(au8IdBuf); ++u32i)
        gau8IDBuf[u32i] = au8IdBuf[u32i];

    /* printf("ID: 0x%x, 0x%x, px%x\n", idBuf[0], idBuf[1], idBuf[2]); */

    for (u32i = 0UL; u32i < sizeof(gu8Supported_List) / sizeof(gu8Supported_List[0]); u32i++)
    {
        if (au8IdBuf[0] == gu8Supported_List[u32i])
        {
            i32Ret = SPIM_OK;
            break;
        }
    }

    if (i32Ret != 0)
    {
        SPIM_DBGMSG("Flash initialize failed!! 0x%x\n", au8IdBuf[0]);
    }

    return i32Ret;
}

/**
 * @brief      Issue JEDEC ID (0x9F) command to read manufacturer and product ID.
 *
 * @param      spim       Pointer to the SPIM module.
 * @param      pu8IdBuf   Pointer to an ID buffer with space for 3 bytes:
 *                        - `pu8IdBuf[0]`: Manufacturer ID
 *                        - `pu8IdBuf[1]`: Memory Type / Product ID
 *                        - `pu8IdBuf[2]`: Capacity / Revision Code
 * @param      u32NRx     Number of bytes to read. Must be at least 3.
 * @param      u32NBit    N-bit transmit/receive mode. One of:
 *                        - \ref SPIM_BITMODE_1
 *                        - \ref SPIM_BITMODE_2
 *                        - \ref SPIM_BITMODE_4
 *                        - \ref SPIM_BITMODE_8
 *
 * @return     None.
 *
 * @note       Some vendors may require dummy cycles or specific bit modes to return valid ID.
 * @note       This function assumes the SPI Flash is in legacy 1S-1S-1S mode before OPI mode is entered.
 */
void SPIM_ReadJedecId(SPIM_T *spim, uint8_t *pu8IdBuf, uint32_t u32NRx, uint32_t u32NBit)
{
    /* 1-byte JEDEC ID command. */
    uint8_t au8CmdBuf[2] = {OPCODE_RDID, OPCODE_RDID};

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);
    SPIM_IO_SendDummyByPhase(spim, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 8UL : 0UL);
    _SPIM_ReadData(spim, pu8IdBuf, u32NRx, u32NBit);

