OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/** @cond HIDDEN_SYMBOLS */

/**
 * @brief      Enable or disable Spansion Quad Mode.
 *
 * @param      spim     Pointer to the SPIM peripheral instance.
 * @param      u32IsEn  Operation mode:
 *                      - \ref SPIM_OP_ENABLE  : Enable Quad mode
 *                      - \ref SPIM_OP_DISABLE : Disable Quad mode
 *
 * @return     None.
 *
 * @note       This command sequence is specific to Spansion (Cypress) Flash devices.
 *             Make sure the flash device supports Quad Mode and follows the QE-bit definition
 *             before using this function.
 */
static void _SPIM_EnableSpansionQuadMode(SPIM_T *spim, uint32_t u32IsEn)
{
    uint8_t au8CmdBuf[3];
    uint8_t dataBuf[1], status1;
    volatile int32_t i32Delay = 10000;

    /* Read Status Register-1 */
    au8CmdBuf[0] = OPCODE_RDSR;

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), SPIM_BITMODE_1);

    _SPIM_ReadData(spim, dataBuf, sizeof(dataBuf), SPIM_BITMODE_1);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);
    /* SPIM_DBGMSG("SR1 = 0x%x\n", dataBuf[0]); */

    status1 = dataBuf[0];

    /* Read Configuration Register-2 */
    au8CmdBuf[0] = OPCODE_RDSR2;

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), SPIM_BITMODE_1);

    _SPIM_ReadData(spim, dataBuf, sizeof(dataBuf), SPIM_BITMODE_1);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);
    /* SPIM_DBGMSG("CR1 = 0x%x\n", dataBuf[0]); */

    SPIM_SetWriteEnable(spim, 1, 1UL);

    /* Write register */
    au8CmdBuf[0] = OPCODE_WRSR;
    au8CmdBuf[1] = status1;

    if (u32IsEn)
    {
        /* set QUAD */
        au8CmdBuf[2] = dataBuf[0] | 0x2U;
    }
    else
    {
        /* clear QUAD */
        au8CmdBuf[2] = dataBuf[0] & ~0x2U;
    }

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), SPIM_BITMODE_1);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetWriteEnable(spim, SPIM_OP_DISABLE, SPIM_BITMODE_1);

    /* Read Configuration Register-2 */
    au8CmdBuf[0] = OPCODE_RDSR2;

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), SPIM_BITMODE_1);

    _SPIM_ReadData(spim, dataBuf, sizeof(dataBuf), SPIM_BITMODE_1);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    /* SPIM_DBGMSG("CR1 = 0x%x\n", dataBuf[0]); */
    while (--i32Delay >= 0)
    {
        __NOP();
    }
}

/** @endcond HIDDEN_SYMBOLS */

/**
 * @brief      Enable or disable SPI Flash Quad Mode.
 *
 * @param[in]  spim     Pointer to the SPIM peripheral instance.
 * @param[in]  u32IsEn  Desired Quad Mode state.
 *                      - \ref SPIM_OP_ENABLE  : Enable Quad mode
 *                      - \ref SPIM_OP_DISABLE : Disable Quad mode
 * @param[in]  u32NBit  SPI transfer bit mode for issuing the command.
 *                      - \ref SPIM_BITMODE_1  : Standard 1-bit SPI mode
 *                      - \ref SPIM_BITMODE_2  : Dual output mode
 *                      - \ref SPIM_BITMODE_4  : Quad output mode
 *                      - \ref SPIM_BITMODE_8  : Octal output mode
 *
 * @return     None.
 *
 * @note       Before enabling Quad mode, ensure that the Flash device supports it,
 *             and the QE bit location is correctly handled in vendor-specific logic.
 */
void SPIM_SetQuadEnable(SPIM_T *spim, uint32_t u32IsEn, uint32_t u32NBit)
{
    uint8_t au8IdBuf[3];
    uint8_t dataBuf[2];

    SPIM_ReadJedecId(spim, au8IdBuf, sizeof(au8IdBuf), u32NBit);

    SPIM_DBGMSG("SPIM_SetQuadEnable - Flash ID is 0x%x\n", au8IdBuf[0]);

    switch (au8IdBuf[0])
    {
        /* Winbond SPI flash */
        case MFGID_WINBOND:
            SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
            _SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
            SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);

            if (u32IsEn)
            {
                dataBuf[1] |= SR2_QE;
            }
            else
            {
                dataBuf[1] &= ~SR2_QE;
            }

            /* Write Enable. */
            SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);
            _SPIM_WriteStatusRegister2(spim, dataBuf, sizeof(dataBuf), u32NBit);
            _SPIM_WaitWriteDone(spim, u32NBit);

            SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
            _SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
            SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
            break;

        /* MXIC SPI flash. */
        case MFGID_MXIC:
        case MFGID_EON:

        /* ISSI SPI flash. */
        case MFGID_ISSI:
            /* Write Enable. */
            SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);

            dataBuf[0] = u32IsEn ? SR_QE : 0U;

            _SPIM_WriteStatusRegister(spim, dataBuf, sizeof(dataBuf), u32NBit);

            _SPIM_WaitWriteDone(spim, u32NBit);
            break;

        case MFGID_SPANSION:
            _SPIM_EnableSpansionQuadMode(spim, u32IsEn);
            break;

        default:
            break;
    }
}

/**
 * @brief      Enable or disable QPI (Quad Peripheral Interface) mode.
 *
 * @param[in]  spim    Pointer to the SPIM peripheral instance.
 * @param[in]  i32IsEn Set to 1 to enable QPI mode, or 0 to disable it.
 *                     - \ref SPIM_OP_ENABLE  : Enable QPI mode
 *                     - \ref SPIM_OP_DISABLE : Disable QPI mode
 * @return     None
 */
static void _SPIM_EonSetQpiMode(SPIM_T *spim, int32_t i32IsEn)
{
    /* 1-byte command.  */
    uint8_t au8CmdBuf[1];
    uint8_t au8Status[1];

    SPIM_ReadStatusRegister(spim, au8Status, sizeof(au8Status), SPIM_BITMODE_1);
    SPIM_DBGMSG("Status: 0x%x\n", status[0]);

    if (i32IsEn)
    {
        /* Assume in SPI mode. */
        au8CmdBuf[0] = OPCODE_ENQPI;

        /* CS activated. */
        SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

        _SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), SPIM_BITMODE_1);

