OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
        /* CS deactivated. */
        SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);
    }
    else
    {
        /* Assume in QPI mode. */
        au8CmdBuf[0] = OPCODE_EXQPI;

        /* CS activated. */
        SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

        _SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), SPIM_BITMODE_4);

        /* CS deactivated. */
        SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);
    }

    SPIM_ReadStatusRegister(spim, au8Status, sizeof(au8Status), 1UL);
    SPIM_DBGMSG("Status: 0x%x\n", status[0]);
}

/**
 * @brief      Enable or disable 4-byte address mode for Spansion SPI Flash.
 * @param[in]  spim     Pointer to the SPIM peripheral instance.
 * @param[in]  u32IsEn  Enable or disable 4-byte address mode.
 *                      - \ref SPIM_OP_ENABLE
 *                      - \ref SPIM_OP_DISABLE
 * @param[in]  u32NBit  Bit mode used for command transmission.
 *                      - \ref SPIM_BITMODE_1 : 1-bit mode
 *                      - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                      - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                      - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @return     None
 */
static void _SPIM_SPANSION4BytesEnable(SPIM_T *spim, uint32_t u32IsEn, uint32_t u32NBit)
{
    uint8_t au8CmdBuf[2];
    uint8_t au8DataBuf[1];

    au8CmdBuf[0] = OPCODE_BRRD;

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, 1UL, u32NBit);

    _SPIM_ReadData(spim, au8DataBuf, 1UL, SPIM_BITMODE_1);

    /* CS deactivated.  */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_DBGMSG("Bank Address register= 0x%x\n", au8DataBuf[0]);

    au8CmdBuf[0] = OPCODE_BRWR;

    if (u32IsEn)
    {
        /* set EXTADD */
        au8CmdBuf[1] = au8DataBuf[0] | 0x80U;
    }
    else
    {
        /* clear EXTADD */
        au8CmdBuf[1] = au8DataBuf[0] & ~0x80U;
    }

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), SPIM_BITMODE_1);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);
}

/** @cond HIDDEN_SYMBOLS */
/**
 * @brief      Query whether 4-byte address mode is enabled.
 * @param[in]  spim      Pointer to the SPIM peripheral instance.
 * @param[in]  u32NBit   Bit mode used for command transmission.
 *                       - \ref SPIM_BITMODE_1 : 1-bit mode
 *                       - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                       - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                       - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @retval     0         4-byte address mode is disabled.
 * @retval     1         4-byte address mode is enabled.
 */
int32_t SPIM_Is4ByteModeEnable(SPIM_T *spim, uint32_t u32NBit)
{
    int32_t isEn = 0;
    uint8_t idBuf[3];
    uint8_t dataBuf[2];

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit);

    switch (idBuf[0])
    {
        case MFGID_WINBOND:
            _SPIM_ReadStatusRegister3(spim, dataBuf, sizeof(dataBuf), u32NBit);
            /* Before MX25L6406E, bit 6 of Status Register-3 is reserved. */
            isEn = (idBuf[2] < 0x16U) ? !SPIM_OP_ENABLE : !!(dataBuf[0] & SR3_ADR);
            break;

        case MFGID_MXIC:
        case MFGID_EON:
            _SPIM_ReadSecurityRegister(spim, dataBuf, sizeof(dataBuf), u32NBit);
            /* Before MT25QL512ABA, bit 4 of Security Register is reserved. */
            isEn = (idBuf[2] < 0x19U) ? !SPIM_OP_ENABLE : !!(dataBuf[0] & SCUR_4BYTE);
            break;

        case MFGID_ISSI:
            /* Before IS25LP016D, 4-byte address mode supported. */
            isEn = (idBuf[2] < 0x49U) ? SPIM_OP_DISABLE : SPIM_OP_ENABLE;
            break;

        case MFGID_MICRON:
            /* Before MT35XL01G1AA, bit 6 of Flag Register is reserved. */
            _SPIM_ReadMT35xFlagRegister(spim, dataBuf, sizeof(dataBuf), u32NBit);
            isEn = !!(dataBuf[0] & SR3_ADR);
            break;

        default:
            break;
    }

    return isEn;
}

/** @endcond HIDDEN_SYMBOLS  */

/**
 * @brief      Enter or exit 4-byte address mode on the SPI Flash device.
 * @param[in]  spim      Pointer to the SPIM peripheral instance.
 * @param[in]  u32IsEn   Enable or disable 4-byte address mode.
 *                       - \ref SPIM_OP_ENABLE  : Enter 4-byte address mode
 *                       - \ref SPIM_OP_DISABLE : Exit 4-byte address mode
 * @param[in]  u32NBit   Bit mode used for command transmission.
 *                       - \ref SPIM_BITMODE_1 : 1-bit mode
 *                       - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                       - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                       - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @retval     SPIM_OK         Operation completed successfully.
 * @retval     SPIM_ERR_FAIL   Operation failed (e.g., unsupported command or communication error).
 */
int32_t SPIM_Enable_4Bytes_Mode(SPIM_T *spim, uint32_t u32IsEn, uint32_t u32NBit)
{
    int32_t i32IsSupt = 0L, i32Ret = SPIM_ERR_FAIL;
    uint8_t au8IdBuf[3];
    /* 1-byte Enter/Exit 4-Byte Mode command. */
    uint8_t u8CmdBuf[2];
    volatile int32_t i32TimeOutCount = 0;

    SPIM_ReadJedecId(spim, au8IdBuf, sizeof(au8IdBuf), u32NBit);

    /* Based on Flash size, check if 4-byte address mode is supported. */
    switch (au8IdBuf[0])
    {
        case MFGID_WINBOND:
            i32IsSupt = (au8IdBuf[2] < 0x16U) ? SPIM_OP_DISABLE : SPIM_OP_ENABLE;
            break;

        case MFGID_MXIC:
        case MFGID_EON:
            i32IsSupt = (au8IdBuf[2] < 0x19U) ? SPIM_OP_DISABLE : SPIM_OP_ENABLE;
            break;

        case MFGID_ISSI:
            i32IsSupt = (au8IdBuf[2] < 0x49U) ? SPIM_OP_DISABLE : SPIM_OP_ENABLE;
            break;

        case MFGID_SPANSION:
            _SPIM_SPANSION4BytesEnable(spim, u32IsEn, u32NBit);
            i32IsSupt = SPIM_OP_ENABLE;
            i32Ret = SPIM_OK;
            break;

        case MFGID_MICRON:
            //SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);
            i32IsSupt = SPIM_OP_ENABLE;
            break;

        default:
            break;
    }

