OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    if ((i32IsSupt) && (au8IdBuf[0] != MFGID_SPANSION))
    {
        u8CmdBuf[0] = u8CmdBuf[1] = u32IsEn ? OPCODE_EN4B : OPCODE_EX4B;

        /* CS activated. */
        SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

        _SPIM_WriteData(spim, u8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

        /* CS deactivated.  */
        SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

        /*
         * FIXME: Per test, 4BYTE Indicator bit doesn't set after EN4B, which
         * doesn't match spec(MX25L25635E), so skip the check below.
         */
        i32Ret = SPIM_OK;

        if (au8IdBuf[0] != MFGID_MXIC)
        {
            /*
             *  About over 100 instrucsions executed, just want to give
             *  a time-out about 1 seconds to avoid infinite loop
             */
            i32TimeOutCount = (SystemCoreClock) / 100;

            while ((--i32TimeOutCount >= 0) && ((uint32_t)SPIM_Is4ByteModeEnable(spim, u32NBit) != u32IsEn)) {}

            if (i32TimeOutCount <= 0)
                i32Ret = SPIM_ERR_FAIL;
        }
    }

    return i32Ret;
}

/**
 * @brief      Unlock Winbond flash chip with security bit enabled.
 * @param[in]  spim      Pointer to the SPIM peripheral instance.
 * @param[in]  u32NBit   Bit mode used for command transmission.
 *                       - \ref SPIM_BITMODE_1 : 1-bit mode
 *                       - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                       - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                       - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @return     None.
 * @note       This function issues the Winbond-specific unlock sequence
 *             to disable security features and allow full chip access.
 */
void SPIM_WinbondUnlock(SPIM_T *spim, uint32_t u32NBit)
{
    uint8_t idBuf[3];
    uint8_t dataBuf[4];

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit);

    if ((idBuf[0] != MFGID_WINBOND) || (idBuf[1] != 0x40) || (idBuf[2] != 0x16))
    {
        SPIM_DBGMSG("SPIM_WinbondUnlock - Not W25Q32, do nothing.\n");
        return;
    }

    SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
    _SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
    SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);

    /* clear Status Register-1 SEC bit */
    dataBuf[1] &= ~0x40;

    /* Write Enable.    */
    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);
    _SPIM_WriteStatusRegister2(spim, dataBuf, sizeof(dataBuf), u32NBit);
    _SPIM_WaitWriteDone(spim, u32NBit);

    SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
    _SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
    SPIM_DBGMSG("Status Register (after unlock): 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
}

/**
 * @brief      Erase the entire SPI flash chip.
 * @param[in]  spim      Pointer to the SPIM peripheral instance.
 * @param[in]  u32NBit   Bit mode used for command transmission.
 *                       - \ref SPIM_BITMODE_1 : 1-bit mode
 *                       - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                       - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                       - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @param[in]  i32IsSync Whether to wait until the erase operation is completed.
 *                       - 1: Wait (blocking mode)
 *                       - 0: Return immediately (non-blocking)
 * @return     None.
 * @note       The chip erase operation may take several seconds to complete.
 *             Ensure the flash is write-enabled before calling this function.
 */
void SPIM_ChipErase(SPIM_T *spim, uint32_t u32NBit, int32_t i32IsSync)
{
    /* 1-byte Chip Erase command. */
    uint8_t cmdBuf[2] = {OPCODE_CHIP_ERASE, OPCODE_CHIP_ERASE};

    /* Write Enable. */
    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, cmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    if (i32IsSync)
    {
        _SPIM_WaitWriteDone(spim, u32NBit);
    }
}

/**
 * @brief      Erase a specific block in SPI flash memory.
 * @param[in]  spim            Pointer to the SPIM peripheral instance.
 * @param[in]  u32Addr         Target address within the block to erase.
 * @param[in]  u32Is4ByteAddr  Whether the flash uses a 4-byte address.
 *                             - 0: 3-byte address mode
 *                             - 1: 4-byte address mode
 * @param[in]  u32ErsCmd       Block erase command opcode.
 *                             - \ref OPCODE_SE_4K  : Sector Erase 4KB
 *                             - \ref OPCODE_BE_32K : Block Erase 32KB
 *                             - \ref OPCODE_BE_64K : Block Erase 64KB
 * @param[in]  u32NBit         Bit mode used for transmission.
 *                             - \ref SPIM_BITMODE_1 : 1-bit mode
 *                             - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                             - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                             - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @param[in]  i32IsSync       Whether to wait for the erase to complete.
 *                             - 1: Wait until erase is complete (blocking mode)
 *                             - 0: Return immediately (non-blocking mode)
 * @return     None.
 * @note       Ensure the flash is write-enabled before calling this function.
 *             The erase command will affect the entire block that contains the given address.
 */
void SPIM_EraseBlock(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32ErsCmd, uint32_t u32NBit, int32_t i32IsSync)
{
    uint8_t cmdBuf[6] = {0};
    uint32_t buf_idx = 0UL;

    cmdBuf[buf_idx++] = (uint8_t)u32ErsCmd;

    if ((SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) &&
            (u32NBit == SPIM_BITMODE_8))
    {
        cmdBuf[buf_idx++] = (uint8_t)u32ErsCmd;
        u32Is4ByteAddr = SPIM_OP_ENABLE;
    }

