OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    if (u32Is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24) & 0xFF;
    }

    cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16) & 0xFF;
    cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8) & 0xFF;
    cmdBuf[buf_idx++] = (uint8_t)(u32Addr & 0xFFUL);

    SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, u32NBit);
    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

    /* Write Enable. */
    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    _SPIM_WriteData(spim, cmdBuf, buf_idx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    if (i32IsSync)
    {
        _SPIM_WaitWriteDone(spim, u32NBit);
    }
}


/** @cond HIDDEN_SYMBOLS */

/**
 * @brief      Write data within a single page using the specified I/O mode.
 * @param[in]  u32Addr        Start address to write.
 * @param[in]  u32Is4ByteAddr Whether to use 4-byte addressing.
 *                             - 0: 3-byte address mode
 *                             - 1: 4-byte address mode
 * @param[in]  u32NTx         Number of bytes to write.
 * @param[in]  pu8TxBuf       Pointer to transmit buffer.
 * @param[in]  u8WrCmd        Write command opcode.
 * @param[in]  u32NBitCmd     Bit width for command phase.
 *                             - \ref SPIM_BITMODE_1
 *                             - \ref SPIM_BITMODE_2
 *                             - \ref SPIM_BITMODE_4
 *                             - \ref SPIM_BITMODE_8
 * @param[in]  u32NBitAddr    Bit width for address phase.
 *                             - \ref SPIM_BITMODE_1
 *                             - \ref SPIM_BITMODE_2
 *                             - \ref SPIM_BITMODE_4
 *                             - \ref SPIM_BITMODE_8
 * @param[in]  u32NBitDat     Bit width for data phase.
 *                             - \ref SPIM_BITMODE_1
 *                             - \ref SPIM_BITMODE_2
 *                             - \ref SPIM_BITMODE_4
 *                             - \ref SPIM_BITMODE_8
 * @param[in]  u32IsSync      Whether to wait until operation completes.
 *                             - 1: Blocking mode (wait for write to complete)
 *                             - 0: Non-blocking mode
 * @return     None.
 * @note       The data must not cross a page boundary. Caller must ensure write buffer stays within the same page.
 */
static void _SPIM_WriteInPageDataByIo(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32NTx, uint8_t pu8TxBuf[], uint8_t u8WrCmd,
                                      uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat, uint32_t u32IsSync)
{
    uint8_t au8CmdBuf[16] = {u8WrCmd, u8WrCmd};
    uint32_t u32BufIdx = 0;

    /* Write Enable. */
    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBitCmd);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    /* Write out command. */
    _SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBitCmd);

    u32BufIdx = 0UL;

    if (u32Is4ByteAddr)
    {
        au8CmdBuf[u32BufIdx++] = (uint8_t)(u32Addr >> 24);
    }

    au8CmdBuf[u32BufIdx++] = (uint8_t)(u32Addr >> 16);
    au8CmdBuf[u32BufIdx++] = (uint8_t)(u32Addr >> 8);
    au8CmdBuf[u32BufIdx++] = (uint8_t) u32Addr;

    /* Write out u32Address. */
    _SPIM_WriteData(spim, au8CmdBuf, u32BufIdx, u32NBitAddr);

    /* Write out data. */
    _SPIM_WriteData(spim, pu8TxBuf, u32NTx, u32NBitDat);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    if (u32IsSync)
    {
        _SPIM_WaitWriteDone(spim, u32NBitCmd);
    }
}

/**
 * @brief      Write data within a single page using Page Write mode.
 * @param[in]  u32Addr        Start address to write.
 * @param[in]  u32Is4ByteAddr Whether to use 4-byte addressing.
 *                             - 0: 3-byte address mode
 *                             - 1: 4-byte address mode
 * @param[in]  u32NTx         Number of bytes to write.
 * @param[in]  pu8TxBuf       Pointer to transmit buffer.
 * @param[in]  u8WrCmd        Write command opcode.
 * @param[in]  u32IsSync         Whether to wait for the write to complete.
 *                             - 1: Blocking mode (wait for completion)
 *                             - 0: Non-blocking mode
 * @retval     SPIM_OK           Operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT  Operation aborted due to timeout.
 * @note       If a timeout occurs while waiting for the operation to complete,
 *             this function sets @ref g_SPIM_i32ErrCode to @ref SPIM_TIMEOUT_ERR.
 * @warning    The write must not cross a page boundary. Caller is responsible for ensuring data fits within one page.
 */
static int32_t _SPIM_WriteInPageDataByPageWrite(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32NTx,
                                                uint8_t pu8TxBuf[], uint8_t u8WrCmd, uint32_t u32IsSync)
{
    u32Is4ByteAddr = (SPIM_GET_PHDMAW_ADDR_WIDTH(spim) == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;
    SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, SPIM_PhaseModeToNBit(SPIM_GET_PHDMAW_CMD_BITMODE(spim)));

    /* Write Enable. */
    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, SPIM_PhaseModeToNBit(SPIM_GET_PHDMAW_CMD_BITMODE(spim)));

    u8WrCmd = (((SPIM_GET_PHDMAW_CMD_DTR(spim) == SPIM_OP_ENABLE) &&
                (SPIM_GET_PHDMAW_CMD_WIDTH(spim) == PHASE_WIDTH_16)) ?
               ((uint8_t)(u8WrCmd << 8) | (uint8_t)u8WrCmd) :
               u8WrCmd);

    /* Switch to Page Write mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEWRITE);
    /* SPIM mode. */
    SPIM_SET_CMD_CODE(spim, u8WrCmd);

    /* Enable/disable 4-Byte Address. */
    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

    /* SRAM u32Address. */
    spim->SRAMADDR = (uint32_t) pu8TxBuf;
    /* Transfer length. */
    spim->DMACNT = u32NTx;
    /* Flash u32Address. */
    spim->FADDR = u32Addr;

    SPIM_WaitOpDone(spim, u32IsSync);

    _SPIM_WaitWriteDone(spim, SPIM_PhaseModeToNBit(SPIM_GET_PHDMAW_CMD_BITMODE(spim)));

    if (u8WrCmd == CMD_QUAD_PAGE_PROGRAM_EON)
    {
        /* Exit QPI mode. */
        _SPIM_EonSetQpiMode(spim, 0);
    }

    return SPIM_OK;
}

/** @endcond HIDDEN_SYMBOLS */

/**
 * @brief      Write data to SPI Flash using manual command sequence (I/O mode).
 * @param[in]  spim         Pointer to the SPIM instance.
 * @param[in]  u32Addr      Start address to write.
 * @param[in]  u32Is4ByteAddr
 *                          Specify address mode.
 *                          - 0: 3-byte address mode
 *                          - 1: 4-byte address mode
 * @param[in]  u32NTx       Number of bytes to write.
 * @param[in]  pu8TxBuf     Pointer to the transmit buffer.
 * @param[in]  u8WrCmd      Write command opcode.
 * @param[in]  u32NBitCmd   N-bit mode for transmitting the command.
 *                          - \ref SPIM_BITMODE_1
 *                          - \ref SPIM_BITMODE_2
 *                          - \ref SPIM_BITMODE_4
 *                          - \ref SPIM_BITMODE_8
 * @param[in]  u32NBitAddr  N-bit mode for transmitting the address.
 *                          - \ref SPIM_BITMODE_1
 *                          - \ref SPIM_BITMODE_2
 *                          - \ref SPIM_BITMODE_4
 *                          - \ref SPIM_BITMODE_8
 * @param[in]  u32NBitDat   N-bit mode for transmitting the data.
 *                          - \ref SPIM_BITMODE_1
 *                          - \ref SPIM_BITMODE_2
 *                          - \ref SPIM_BITMODE_4
 *                          - \ref SPIM_BITMODE_8
 * @return     None.
 *
 * @note       This function does not check for page boundary crossing. Caller must ensure
 *             data does not span across pages unless supported by the flash chip.
 *
 * @warning    This function assumes that the flash is already write-enabled. Be sure to
 *             call the appropriate Write Enable command before using this function.
 */
void SPIM_IO_Write(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32NTx, uint8_t pu8TxBuf[], uint8_t u8WrCmd,
                   uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat)
{
    /* Write out data to SPI Flash in small chunks (max 256 bytes per chunk) */
    /* number of bytes to write in this chunk */
    uint32_t u32ToWr;
    /* index into tx buffer */
    uint32_t u32BufIdx = 0UL;
    /* Query 4-byte address mode enabled or not. */
    uint32_t u32TempIs4ByteAddr = (uint32_t)SPIM_Is4ByteModeEnable(spim, u32NBitCmd);

