OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    if (u32Is4ByteAddr != u32TempIs4ByteAddr)
    {
        SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, SPIM_PhaseModeToNBit(SPIM_GET_PHDMM_CMD_BITMODE(spim)));
    }

    /* Set SPIM 4-Bytes Address Mode */
    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

    while (u32NTx)
    {
        u32ToWr = (u32NTx < SPIM_FLH_PAGE_SIZE) ? u32NTx : SPIM_FLH_PAGE_SIZE;

        _SPIM_WriteInPageDataByIo(spim, u32Addr, u32Is4ByteAddr,
                                  u32ToWr, &pu8TxBuf[u32BufIdx], u8WrCmd,
                                  u32NBitCmd, u32NBitAddr, u32NBitDat,
                                  SPIM_OP_ENABLE);
        u32Addr += u32ToWr;
        u32NTx -= u32ToWr;
        u32BufIdx += u32ToWr;
    }

    if (u32Is4ByteAddr != u32TempIs4ByteAddr)
    {
        SPIM_Enable_4Bytes_Mode(spim, u32TempIs4ByteAddr, SPIM_PhaseModeToNBit(SPIM_GET_PHDMM_CMD_BITMODE(spim)));
    }

    /* Set SPIM 4-Bytes Address Mode */
    SPIM_SET_4BYTE_ADDR(spim, u32TempIs4ByteAddr);
}

/**
 * @brief      Read data from SPI Flash using manual command sequence (I/O mode).
 * @param[in]  spim         Pointer to the SPIM instance.
 * @param[in]  u32Addr      Start address to read.
 * @param[in]  u32Is4ByteAddr
 *                          Specify address mode.
 *                          - 0: 3-byte address mode
 *                          - 1: 4-byte address mode
 * @param[in]  u32NRx       Number of bytes to read.
 * @param[out] pu8RxBuf     Pointer to the receive buffer.
 * @param[in]  rdCmd        Read command opcode.
 * @param[in]  u32NBitCmd   N-bit mode for transmitting the command.
 *                          - \ref SPIM_BITMODE_1
 *                          - \ref SPIM_BITMODE_2
 *                          - \ref SPIM_BITMODE_4
 *                          - \ref SPIM_BITMODE_8
 * @param[in]  u32NBitAddr  N-bit mode for transmitting the address.
 *                          - \ref SPIM_BITMODE_1
 *                          - \ref SPIM_BITMODE_2
 *                          - \ref SPIM_BITMODE_4
 *                          - \ref SPIM_BITMODE_8
 * @param[in]  u32NBitDat   N-bit mode for transmitting/receiving data.
 *                          - \ref SPIM_BITMODE_1
 *                          - \ref SPIM_BITMODE_2
 *                          - \ref SPIM_BITMODE_4
 *                          - \ref SPIM_BITMODE_8
 * @param[in]  u32NDummy    Number of dummy cycles (clock cycles) after address phase.
 *
 * @return     None.
 *
 * @note       Caller must ensure that the read command is compatible with the selected bit
 *             modes and that the flash is ready for read operation.
 *
 * @warning    This function does not automatically handle status polling or chip select timing.
 *             Make sure the flash is not busy before calling this function.
 */
void SPIM_IO_Read(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32NRx, uint8_t pu8RxBuf[], uint8_t rdCmd,
                  uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat, uint32_t u32NDummy)
{
    uint8_t cmdBuf[8] = {rdCmd, rdCmd};
    uint32_t buf_idx = 0UL;
    /* Query 4-byte address mode enabled or not. */
    uint32_t u32TempIs4ByteAddr = (uint32_t)SPIM_Is4ByteModeEnable(spim, u32NBitCmd);

    if (u32Is4ByteAddr != u32TempIs4ByteAddr)
    {
        SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, SPIM_PhaseModeToNBit(SPIM_GET_PHDMM_CMD_BITMODE(spim)));
    }

    /* Set SPIM 4-Bytes Address Mode */
    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    /* Write out command. */
    _SPIM_WriteData(spim, cmdBuf, SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE ? 2UL : 1UL, u32NBitCmd);

    if (u32Is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
    }

    cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
    cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
    cmdBuf[buf_idx++] = (uint8_t) u32Addr;

    /* Add a byte for the address phase for dual or quad mode for read mode */
    buf_idx += ((u32NBitAddr == SPIM_BITMODE_2) || (u32NBitAddr == SPIM_BITMODE_4)) ? 1UL : 0UL;

    _SPIM_WriteData(spim, cmdBuf, buf_idx, u32NBitAddr);    /* Write out u32Address. */

    /* Same bit mode as above. */
    SPIM_IO_SendDummyByPhase(spim, u32NDummy);              /* Write out dummy bytes. */

    /* Read back data. */
    _SPIM_ReadData(spim, pu8RxBuf, u32NRx, u32NBitDat);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    if (u32Is4ByteAddr != u32TempIs4ByteAddr)
    {
        SPIM_Enable_4Bytes_Mode(spim, u32TempIs4ByteAddr, SPIM_PhaseModeToNBit(SPIM_GET_PHDMM_CMD_BITMODE(spim)));
    }

    /* Set SPIM 4-Bytes Address Mode */
    SPIM_SET_4BYTE_ADDR(spim, u32TempIs4ByteAddr);
}

/**
 * @brief      Write data to SPI Flash using Page Write mode with PHDMAW.
 * @param[in]  spim           Pointer to the SPIM instance.
 * @param[in]  u32Addr        Start address to write.
 * @param[in]  u32Is4ByteAddr Specify whether 4-byte address mode is used.
 *                            - 0: 3-byte address mode
 *                            - 1: 4-byte address mode
 * @param[in]  u32NTx         Number of bytes to write.
 * @param[in]  pu8TxBuf       Pointer to the transmit buffer.
 * @param[in]  u32WrCmd       Write command opcode.
 *
 * @note       This function is optimized for aligned and page-boundary write operations.
 *             Make sure that the flash is write-enabled and ready before calling this function.
 *             The number of bytes to write must be a multiple of 8 (for DMA alignment).
 */
void SPIM_DMA_Write(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr,
                    uint32_t u32NTx, uint8_t *pu8TxBuf, uint32_t u32WrCmd)
{
    /* number of bytes to write in this chunk */
    uint32_t toWr;
    /* index into tx buffer */
    uint32_t buf_idx = 0UL;

    while (u32NTx)
    {
        toWr = (u32NTx <= SPIM_FLH_PAGE_SIZE) ? u32NTx : SPIM_FLH_PAGE_SIZE;

        _SPIM_WriteInPageDataByPageWrite(spim, u32Addr, u32Is4ByteAddr, toWr, &pu8TxBuf[buf_idx], (uint8_t)u32WrCmd, SPIM_OP_ENABLE);

        /* Advance indicator. */
        u32Addr += toWr;
        u32NTx -= toWr;
        buf_idx += toWr;
    }
}

/**
 * @brief      Read data from SPI Flash using Page Read mode with PHDMAR.
 * @param[in]  spim           Pointer to the SPIM instance.
 * @param[in]  u32Addr        Start address to read.
 * @param[in]  u32Is4ByteAddr Specify whether 4-byte address mode is used.
 *                            - 0: 3-byte address mode
 *                            - 1: 4-byte address mode
 * @param[in]  u32NRx         Number of bytes to read.
 * @param[out] pu8RxBuf       Pointer to the receive buffer.
 * @param[in]  u32RdCmd       Read command opcode.
 * @param[in]  u32IsSync      Specify whether to use blocking mode.
 *                            - 0: Non-blocking (return immediately)
 *                            - 1: Blocking (wait for completion)
 *
 * @retval     SPIM_OK            Operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT   Operation failed due to timeout.
 *
 * @note       Before calling this API, you must initialize the read phase by calling
 *             @ref SPIM_DMADMM_InitPhase with appropriate settings for PHDMAR (Page High-Speed DMA Read).
 */
int32_t SPIM_DMA_Read(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32NRx, uint8_t pu8RxBuf[],
                      uint32_t u32RdCmd, uint32_t u32IsSync)
{
    u32Is4ByteAddr = (SPIM_GET_PHDMAR_ADDR_WIDTH(spim) == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;
    SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, SPIM_PhaseModeToNBit(SPIM_GET_PHDMAR_CMD_BITMODE(spim)));

    u32RdCmd = (((SPIM_GET_PHDMAR_CMD_DTR(spim) == SPIM_OP_ENABLE) &&
                 (SPIM_GET_PHDMAR_CMD_WIDTH(spim) == PHASE_WIDTH_16)) ?
                ((u32RdCmd << 8) | u32RdCmd) :
                u32RdCmd);

    /* Switch to Page Read mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEREAD);
    /* SPIM mode. */
    SPIM_SET_CMD_CODE(spim, u32RdCmd);
    /* Enable/disable 4-Byte Address. */
    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

    /* SRAM u32Address. */
    spim->SRAMADDR = (uint32_t) pu8RxBuf;
    /* Transfer length. */
    spim->DMACNT = u32NRx;
    /* Flash u32Address. */
    spim->FADDR = u32Addr;

    return SPIM_WaitOpDone(spim, u32IsSync);
}

/**
 * @brief      Enter Direct Map Mode (DMM) for memory-mapped SPI Flash access.
 *
 * @param[in]  spim            Pointer to the SPIM instance.
 * @param[in]  u32Is4ByteAddr  Specify whether 4-byte address mode is used.
 *                             - 0: Use 3-byte address mode.
 *                             - 1: Use 4-byte address mode.
 * @param[in]  u32RdCmd        SPI Flash read command used in DMM mode (e.g., 0x0B, 0x6B, 0xEB).
 * @param[in]  u32IdleIntvl    Idle interval between transactions, in SPIM clock cycles.
 *
 * @return     None.
 *
 * @note       Before entering DMM, ensure the Flash is ready and in the correct mode
 *             (e.g., QSPI, DTR). The command should match the expected Flash read protocol.
 */
void SPIM_EnterDirectMapMode(SPIM_T *spim, uint32_t u32Is4ByteAddr, uint32_t u32RdCmd, uint32_t u32IdleIntvl)
{
    u32Is4ByteAddr = (SPIM_GET_PHDMM_ADDR_WIDTH(spim) == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;
    SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, SPIM_PhaseModeToNBit(SPIM_GET_PHDMM_CMD_BITMODE(spim)));

