OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
static void _SPIM_ClearContReadPhase(SPIM_T *spim, uint32_t u32OPMode)
{
    uint32_t *pu32PhaseReg = (uint32_t *)_SPIM_SwitchPhaseRegister(spim, u32OPMode);

    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_READMODE_Pos);
}

/**
 * @brief      Set the Continue Read phase for DMA or Direct Map operation.
 *
 * @param[in]  spim       Pointer to the SPIM instance.
 * @param[in]  u32OPMode  SPI operation mode.
 *                        - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA read mode
 *                        - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Map mode
 * @param[in]  u32NBit    Bit mode used to transmit continue read command.
 *                        - \ref PHASE_NORMAL_MODE : Standard mode (1-bit)
 *                        - \ref PHASE_DUAL_MODE   : Dual mode (2-bit)
 *                        - \ref PHASE_QUAD_MODE   : Quad mode (4-bit)
 *                        - \ref PHASE_OCTAL_MODE  : Octal mode (8-bit)
 * @param[in]  u32Width   Command width.
 *                        - \ref PHASE_WIDTH_8     : 8-bit command
 *                        - \ref PHASE_WIDTH_16    : 16-bit command
 *                        - \ref PHASE_WIDTH_24    : 24-bit command
 *                        - \ref PHASE_WIDTH_32    : 32-bit command
 * @param[in]  u32ContEn  Enable or disable Continue Read mode.
 *                        - \ref PHASE_ENABLE_CONT_READ    : Enable Continue Read mode
 *                        - \ref PHASE_DISABLE_CONT_READM  : Disable Continue Read mode
 * @param[in]  u32DTREn   Enable or disable DTR (Double Transfer Rate) mode.
 *                        - 0: Disable DTR
 *                        - 1: Enable DTR
 *
 * @retval     SPIM_OK          Continue Read phase set successfully.
 * @retval     SPIM_ERR_FAIL    Invalid configuration or operation failed.
 */
static int32_t _SPIM_SetContReadPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit, uint32_t u32Width, uint32_t u32ContEn, uint32_t u32DTREn)
{
    uint32_t *pu32PhaseReg = (uint32_t *)_SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == NULL)
    {
        return SPIM_ERR_FAIL;
    }

    /* clear Read Mode phase setting. */
    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_READMODE_Pos);

    *pu32PhaseReg |= ((u32Width << SPIM_PHDMAR_DW_MODE_Pos) |
                      (u32NBit << SPIM_PHDMAR_BM_MODE_Pos) |
                      (u32DTREn << SPIM_PHDMAR_DTR_MODE_Pos));

    if (u32ContEn == PHASE_ENABLE_CONT_READ)
    {
        SPIM_ENABLE_DMM_CREN(spim);

        /* Enable Contiue Read Mode */
        SPIM_SET_MODE_DATA(spim, SPIM_DMM_ENABLE_CREN);
    }
    else
    {
        SPIM_CLEAR_MODE_DATA(spim);
    }

    return SPIM_OK;
}

/**
 * @brief      Set the Data Phase configuration for DMA or Direct Map operation.
 *
 * @param[in]  spim          Pointer to the SPIM instance.
 * @param[in]  u32OPMode     SPI operation mode.
 *                           - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA write mode
 *                           - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA read mode
 *                           - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Map mode
 * @param[in]  u32NBit       Bit mode used during the data phase.
 *                           - \ref PHASE_NORMAL_MODE : Standard mode (1-bit)
 *                           - \ref PHASE_DUAL_MODE   : Dual mode (2-bit)
 *                           - \ref PHASE_QUAD_MODE   : Quad mode (4-bit)
 *                           - \ref PHASE_OCTAL_MODE  : Octal mode (8-bit)
 * @param[in]  u32ByteOrder  Data byte order for Octal SPI Flash during read phase.
 *                           - \ref PHASE_ORDER_MODE0 : {byte0, byte1, byte2, byte3, byte4, byte5, byte6, byte7}
 *                           - \ref PHASE_ORDER_MODE1 : {byte7, byte6, byte5, byte4, byte3, byte2, byte1, byte0}
 *                           - \ref PHASE_ORDER_MODE2 : {byte1, byte0, byte3, byte2, byte5, byte4, byte7, byte6}
 *                           - \ref PHASE_ORDER_MODE3 : {byte6, byte7, byte4, byte5, byte2, byte3, byte0, byte1}
 * @param[in]  u32DTREn      Enable or disable DTR (Double Transfer Rate) mode.
 *                           - \ref SPIM_OP_ENABLE
 *                           - \ref SPIM_OP_DISABLE
 * @param[in]  u32RdDQS      Enable or disable Read DQS (Data Strobe).
 *                           - \ref SPIM_OP_ENABLE
 *                           - \ref SPIM_OP_DISABLE
 *
 * @retval     SPIM_OK       Configuration successful.
 * @retval     SPIM_ERR_FAIL Configuration failed.
 */
static int32_t _SPIM_SetDataPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit,
                                  uint32_t u32ByteOrder, uint32_t u32DTREn, uint32_t u32RdDQS)
{
    uint32_t *pu32PhaseReg = (uint32_t *)_SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == NULL)
    {
        return SPIM_ERR_FAIL;
    }

    /* clear Data phase setting. */
    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_DATA_Pos);

    *pu32PhaseReg |= ((u32RdDQS << SPIM_PHDMAR_RDQS_DATA_Pos)    |
                      (u32DTREn << SPIM_PHDMAR_DTR_DATA_Pos)     |
                      (u32ByteOrder << SPIM_PHDMAW_PBO_DATA_Pos) |
                      (u32NBit << SPIM_PHDMAR_BM_DATA_Pos));

    return SPIM_OK;
}

#if (SPIM_MLDOPL0_ADJ_OFFSET == 1)

/**
 * @brief      Adjust power level for DQS operation.
 *
 * @retval     None
 */
static void SPIM_AdjustPowerLevelForDQS(void)
{
    uint32_t u32RegLockLevel = SYS_IsRegLocked();
    uint32_t u32MLDOPL0;
    volatile int32_t i32TimeOutCnt = (SystemCoreClock >> 1); /* 500ms time-out */

    /* Unlock protected registers */
    if (u32RegLockLevel) SYS_UnlockReg();

    /*
        Raise PL0 voltage level (MLDOPL0) by predefined offset to reach ~1.2V,
        improving signal integrity and timing margin when DQS is enabled.
    */
    u32MLDOPL0 = (SPIM_GET_MLDOTCTL_MLDOPL0VT() + SPIM_MLDOPL0_TRIM_OFFSET);
    SPIM_SET_MLDOTCTL_MLDOPL0VT(u32MLDOPL0);

    /* Wait until WRBUSY cleared */
    i32TimeOutCnt = (SystemCoreClock >> 1);

    while (SPIM_GET_MLDOTCTL_WRBUSY() == SPIM_OP_ENABLE)
        if (i32TimeOutCnt-- <= 0) break;

