OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    /* Wait until power level busy flag cleared */
    i32TimeOutCnt = (SystemCoreClock >> 1);

    while ((*(volatile uint32_t *)PMC_PLCTL_BUSY_FLAG) & BIT31)
        if (i32TimeOutCnt-- <= 0) break;

    /* Set power voltage level to PL0 */
    PMC->PLCTL = (PMC->PLCTL & (~PMC_PLCTL_PLSEL_Msk)) | (PMC_PLCTL_PLSEL_PL0);

    /* Wait again until busy flag cleared */
    i32TimeOutCnt = (SystemCoreClock >> 1);

    while ((*(volatile uint32_t *)PMC_PLCTL_BUSY_FLAG) & BIT31)
        if (i32TimeOutCnt-- <= 0) break;

    /* Increase DLL0 output voltage by predefined offset to reach ~1.2V for better timing margin */
    u32MLDOPL0 = (SPIM_GET_DLLTCTL_DLL0OLDOTRIM() + SPIM_DLLTCTL_TRIM_OFFSET);
    SPIM_SET_DLLTCTL_DLL0OLDOTRIM(u32MLDOPL0);

    /* Lock protected registers */
    if (u32RegLockLevel) SYS_LockReg();
}
#endif

/**
 * @brief      Initialize command phase settings for DMA/DMM SPI Flash operations.
 *
 * @param[in]  spim           Pointer to the SPIM instance.
 * @param[in]  psPhaseTable   Pointer to the command phase table. This table must be
 *                            defined according to the supported command codes of the
 *                            target SPI Flash device.
 * @param[in]  u32OPMode      SPI operation mode:
 *                            - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA write mode
 *                            - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA read mode
 *                            - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @return     None.
 */
void SPIM_DMADMM_InitPhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable, uint32_t u32OPMode)
{
    uint32_t u32Is4ByteAddr = 0;
    uint32_t u32QuadMode = 0;
    uint32_t u32CmdBit = SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase);

#if (SPIM_MLDOPL0_ADJ_OFFSET == 1)

    // Check if the operation mode is either page read or direct map
    // and if RDQS is enabled in the phase table
    if (((u32OPMode == SPIM_CTL0_OPMODE_PAGEREAD) ||
            (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP)) &&
            (psPhaseTable->u32RDQS == SPIM_OP_ENABLE))
    {
        // Adjust power level for DQS
        SPIM_AdjustPowerLevelForDQS();
    }

#endif

    /* Set SPIM DTR Mode */
    SPIM_SET_DTR_MODE(spim, psPhaseTable->u32CMDDTR);

    u32Is4ByteAddr = ((psPhaseTable->u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);

    SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, u32CmdBit);

    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

    u32QuadMode = (((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
                    (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE)) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);

    SPIM_SetQuadEnable(spim, u32QuadMode, u32CmdBit);

    SPIM_DISABLE_DMM_BWEN(spim);
    SPIM_DISABLE_DMM_CREN(spim);

    /* Set Flash Command Phase */
    _SPIM_SetCMDPhase(spim,
                      u32OPMode,
                      psPhaseTable->u32CMDPhase,
                      psPhaseTable->u32CMDWidth,
                      psPhaseTable->u32CMDDTR);

    /* Set Flash Address Phase */
    _SPIM_SetAddrPhase(spim,
                       u32OPMode,
                       psPhaseTable->u32AddrPhase,
                       psPhaseTable->u32AddrWidth,
                       psPhaseTable->u32AddrDTR);

    /* Set DMA Read/DMM Continue Read Phase */
    _SPIM_SetContReadPhase(spim,
                           u32OPMode,
                           psPhaseTable->u32RdModePhase,
                           psPhaseTable->u32RdModeWidth,
                           psPhaseTable->u32ContRdEn,
                           psPhaseTable->u32RdModeDTR);

    /* Set Flash Data Phase */
    _SPIM_SetDataPhase(spim,
                       u32OPMode,
                       psPhaseTable->u32DataPhase,
                       psPhaseTable->u32ByteOrder,
                       psPhaseTable->u32DataDTR,
                       psPhaseTable->u32RDQS);

    /* Set Dummy Cycle After Address. */
    if (u32OPMode == SPIM_CTL0_OPMODE_PAGEREAD)
    {
        SPIM_SET_DMAR_DC(spim, psPhaseTable->u32DcNum);
    }
    else if (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP)
    {
        SPIM_SET_DMM_DC(spim, psPhaseTable->u32DcNum);
    }
}

/*----------------------------------------------------------------------------*/
/* I/O Read/Write Operations by Phase Table                                   */
/*----------------------------------------------------------------------------*/
/**
 * @brief      Send command phase in Normal I/O mode.
 *
 * @param[in]  spim         Pointer to the SPIM instance.
 * @param[in]  u32OPMode    Normal I/O operation mode:
 *                          - \ref SPIM_IO_WRITE_PHASE : Write command phase
 *                          - \ref SPIM_IO_READ_PHASE  : Read command phase
 * @param[in]  u32OpCMD     SPI Flash command to send, defined by the SPI Flash specification.
 * @param[in]  u32CMDPhase  Command bit mode:
 *                          - \ref PHASE_NORMAL_MODE : Send command using Standard mode
 *                          - \ref PHASE_DUAL_MODE   : Send command using Dual mode
 *                          - \ref PHASE_QUAD_MODE   : Send command using Quad mode
 *                          - \ref PHASE_OCTAL_MODE  : Send command using Octal mode
 * @param[in]  u32DTREn     Enable or disable Double Transfer Rate (DTR) mode:
 *                          - \ref SPIM_OP_ENABLE
 *                          - \ref SPIM_OP_DISABLE
 * @return     None.
 */
void SPIM_IO_SendCommandByPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32OpCMD,
                                uint32_t u32CMDPhase, uint32_t u32DTREn)
{
    uint8_t u8CmdBuf[2] = {(uint8_t)u32OpCMD, (uint8_t)u32OpCMD};

    /* DTR Activated. */
    SPIM_SET_DTR_MODE(spim, u32DTREn);

    if (u32OPMode == SPIM_IO_WRITE_PHASE)
    {
        /* Write Enable. */
        SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, SPIM_PhaseModeToNBit(u32CMDPhase));
    }

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    /* Write out command. */
    _SPIM_WriteData(spim, u8CmdBuf, (u32DTREn == SPIM_OP_ENABLE) ? 2UL : 1UL, SPIM_PhaseModeToNBit(u32CMDPhase));

