OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    /* DTR Deactivated. */
    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);
}

/**
 * @brief      Send address phase in Normal I/O mode.
 *
 * @param[in]  spim             Pointer to the SPIM instance.
 * @param[in]  u32Is4ByteAddr   Specify whether to use 4-byte address mode (1: 4-byte, 0: 3-byte).
 * @param[in]  u32Addr          The starting read/write address to be sent.
 * @param[in]  u32AddrPhase     Address bit mode:
 *                              - \ref PHASE_NORMAL_MODE : Send address using Standard mode.
 *                              - \ref PHASE_DUAL_MODE   : Send address using Dual mode.
 *                              - \ref PHASE_QUAD_MODE   : Send address using Quad mode.
 *                              - \ref PHASE_OCTAL_MODE  : Send address using Octal mode.
 * @param[in]  u32DTREn         Enable or disable Double Transfer Rate (DTR) mode:
 *                              - \ref SPIM_OP_ENABLE
 *                              - \ref SPIM_OP_DISABLE
 * @return     None.
 */
void SPIM_IO_SendAddressByPhase(SPIM_T *spim,
                                uint32_t u32Is4ByteAddr,
                                uint32_t u32Addr,
                                uint32_t u32AddrPhase,
                                uint32_t u32DTREn)
{
    uint8_t u8CmdBuf[6] = {0};
    uint8_t u8BufIdx = 0;

    /* DTR Activated. */
    SPIM_SET_DTR_MODE(spim, u32DTREn);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    if (u32Is4ByteAddr)
    {
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 24);
    }

    u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 16);
    u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 8);
    u8CmdBuf[u8BufIdx++] = (uint8_t) u32Addr;

    /* This field is for continuous read mode, but the I/O mode is not supported. */
    if ((gau8IDBuf[0] == MFGID_WINBOND) &&
            ((SPIM_PhaseModeToNBit(u32AddrPhase) == 2) ||
             (SPIM_PhaseModeToNBit(u32AddrPhase) == 4)))
    {
        u8BufIdx++;
    }

    /* Write out u32Address. */
    _SPIM_WriteData(spim, u8CmdBuf, u8BufIdx, SPIM_PhaseModeToNBit(u32AddrPhase));

    /* DTR Deactivated. */
    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);
}

/**
 * @brief      Send dummy cycles in Normal I/O mode.
 *
 * @param[in]  spim       Pointer to the SPIM instance.
 * @param[in]  u32NDummy  Number of dummy clock cycles to insert, typically defined by the SPI Flash command specification.
 *
 * @retval     SPIM_OK        Operation completed successfully.
 * @retval     SPIM_ERR_FAIL  Operation failed due to invalid configuration or hardware issue.
 */
int32_t SPIM_IO_SendDummyByPhase(SPIM_T *spim, uint32_t u32NDummy)
{
    uint32_t u32DTREn = 0;
    int32_t i32Ret = SPIM_OK;

    if (u32NDummy == 0)
    {
        return SPIM_OK;
    }

    u32DTREn = SPIM_GET_DTR_MODE(spim);

    /* DTR Deactivated. */
    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    SPIM_SwitchNBitInput(spim, SPIM_BITMODE_1);
    spim->TX[0] = 0x00;

    /* Switch to Normal mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);
    SPIM_SET_DATA_WIDTH(spim, u32NDummy);
    SPIM_SET_BURST_DATA(spim, SPIM_BITMODE_1);

    i32Ret = SPIM_WaitOpDone(spim, SPIM_OP_ENABLE);

    /* Restore DTR Mode. */
    SPIM_SET_DTR_MODE(spim, u32DTREn);

    return i32Ret;
}

/**
 * @brief      Execute data phase in Normal I/O mode.
 *
 * @param[in]  spim           Pointer to the SPIM instance.
 * @param[in]  u32OPMode      Operation mode for Normal I/O.
 *                            - \ref SPIM_IO_WRITE_PHASE : Write mode.
 *                            - \ref SPIM_IO_READ_PHASE  : Read mode.
 * @param[in,out] pu8TRxBuf   Pointer to transmit or receive data buffer.
 *                            - In write mode: pointer to transmit data.
 *                            - In read mode: buffer for received data.
 * @param[in]  u32TRxSize     Size of data to transmit or receive in bytes.
 * @param[in]  u32DataPhase   Data phase bit mode.
 *                            - \ref PHASE_NORMAL_MODE : Standard mode.
 *                            - \ref PHASE_DUAL_MODE   : Dual mode.
 *                            - \ref PHASE_QUAD_MODE   : Quad mode.
 *                            - \ref PHASE_OCTAL_MODE  : Octal mode.
 * @param[in]  u32DTREn       Enable or disable DTR (Double Transfer Rate) mode.
 *                            - \ref SPIM_OP_ENABLE
 *                            - \ref SPIM_OP_DISABLE
 * @param[in]  u32RdDQS       Enable or disable DQS input during read.
 *                            - \ref SPIM_OP_ENABLE
 *                            - \ref SPIM_OP_DISABLE
 *
 * @retval     SPIM_OK        Operation successful.
 * @retval     SPIM_ERR_FAIL  Operation failed.
 */
void SPIM_IO_RWDataByPhase(SPIM_T *spim, uint32_t u32OPMode, uint8_t *pu8TRxBuf,
                           uint32_t u32TRxSize, uint32_t u32DataPhase, uint32_t u32DTREn, uint32_t u32RdDQS)
{
    /* DTR Activated. */
    SPIM_SET_DTR_MODE(spim, u32DTREn);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    if (gau8IDBuf[0] == MFGID_IFX)
        SPIM_SET_RDQS_MODE(spim, u32RdDQS);

    if (u32OPMode == SPIM_IO_WRITE_PHASE)
    {
        /* Write out data. */
        _SPIM_WriteData(spim, pu8TRxBuf, u32TRxSize, SPIM_PhaseModeToNBit(u32DataPhase));
    }
    else
    {
        /* Read back data. */
        _SPIM_ReadData(spim, pu8TRxBuf, u32TRxSize, SPIM_PhaseModeToNBit(u32DataPhase));
    }

    /* CS Deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SET_RDQS_MODE(spim, SPIM_OP_DISABLE);

    /* DTR Deactivated. */
    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);
}

/**
 * @brief      Write data to SPI Flash using command and phase settings in Normal I/O mode.
 *
 * @param[in]  spim            Pointer to the SPIM instance.
 * @param[in]  psPhaseTable    Pointer to the SPIM phase table, which contains command and phase configuration.
 * @param[in]  u32Addr         Target address in SPI Flash to write data.
 * @param[in]  u32Is4ByteAddr  Set to 1 for 4-byte addressing mode, 0 for 3-byte mode.
 * @param[in]  pu8TxBuf        Pointer to the data buffer to be written to SPI Flash.
 * @param[in]  u32RdSize       Number of bytes to write.
 * @param[in]  u32WrDone       Set to 1 to wait for write complete; 0 to return immediately.
 *
 * @return     None.
 */
static void SPIM_WriteInPageDataByPhaseIO(SPIM_T *spim,
                                          SPIM_PHASE_T *psPhaseTable,
                                          uint32_t u32Addr, uint32_t u32Is4ByteAddr,
                                          uint8_t *pu8TxBuf, uint32_t u32RdSize,
                                          uint32_t u32WrDone)
{
    /* Send command and address. */
    SPIM_IO_SendCommandByPhase(spim, SPIM_IO_WRITE_PHASE, psPhaseTable->u32CMDCode,
                               psPhaseTable->u32CMDPhase, psPhaseTable->u32CMDDTR);

    SPIM_IO_SendAddressByPhase(spim,
                               u32Is4ByteAddr,
                               u32Addr,
                               psPhaseTable->u32AddrPhase,
                               psPhaseTable->u32AddrDTR);

