OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    /* Write out dummy bytes. */
    SPIM_IO_SendDummyByPhase(spim, psPhaseTable->u32DcNum);

    /* Write out data bytes. */
    SPIM_IO_RWDataByPhase(spim,
                          SPIM_IO_WRITE_PHASE,
                          pu8TxBuf,
                          u32RdSize,
                          psPhaseTable->u32DataPhase,
                          psPhaseTable->u32DataDTR,
                          psPhaseTable->u32RDQS);

    if (u32WrDone)
    {
        /* DTR Activated. */
        SPIM_SET_DTR_MODE(spim, psPhaseTable->u32CMDDTR);

        _SPIM_WaitWriteDone(spim, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));

        /* DTR Deactivated. */
        SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);
    }
}

/**
 * @brief      Write data to SPI Flash using specified phase settings (I/O mode).
 *
 * @param[in]  spim          Pointer to the SPIM instance.
 * @param[in]  psPhaseTable  Pointer to the phase table based on SPI Flash specifications.
 *                           This table defines the command and associated phase parameters.
 * @param[in]  u32Addr       Target address in SPI Flash to begin writing.
 * @param[in]  pu8TxBuf      Pointer to the data buffer to be written.
 * @param[in]  u32WrSize     Number of bytes to write.
 * @param[in]  u32WrDone     Set to 1 to wait for write completion; 0 to skip waiting.
 *
 * @return     None.
 */
void SPIM_IO_WriteByPhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable,
                          uint32_t u32Addr, uint8_t *pu8TxBuf, uint32_t u32WrSize, uint32_t u32WrDone)
{
    uint32_t u32DTREn = SPIM_GET_DTR_MODE(spim);
    /* Buffer index. */
    uint32_t u32BufIdx = 0UL;
    /* The number of bytes to write*/
    uint32_t toWr = 0UL;
    /* 4-byte address mode or not. */
    uint32_t u32Is4ByteAddr = ((psPhaseTable->u32AddrWidth == PHASE_WIDTH_32)
                               ? SPIM_OP_ENABLE
                               : SPIM_OP_DISABLE);
    /* Quad mode or not. */
    uint32_t u32QuadMode = (((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
                             (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE)) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);

    SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));
    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

    if (u32QuadMode)
    {
        SPIM_SetQuadEnable(spim, u32QuadMode, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));
    }

    while (u32WrSize)
    {
        toWr = (u32WrSize < SPIM_FLH_PAGE_SIZE) ? u32WrSize : SPIM_FLH_PAGE_SIZE;

        SPIM_WriteInPageDataByPhaseIO(spim, psPhaseTable, u32Addr, u32Is4ByteAddr, &pu8TxBuf[u32BufIdx], toWr, u32WrDone);
        /* Advance indicator. */
        u32Addr += toWr;
        u32WrSize -= toWr;
        u32BufIdx += toWr;
    }

    if (u32QuadMode)
    {
        SPIM_SetQuadEnable(spim, SPIM_OP_DISABLE, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));
    }

    SPIM_SET_DTR_MODE(spim, u32DTREn);
}

/**
 * @brief      Read data from SPI Flash using specified phase settings (I/O mode).
 *
 * @param[in]  spim          Pointer to the SPIM instance.
 * @param[in]  psPhaseTable  Pointer to the SPI Flash phase configuration table.
 *                           This table defines supported commands and transfer phases.
 * @param[in]  u32Addr       Starting address in SPI Flash to read from.
 * @param[out] pu8RxBuf      Pointer to the buffer to store read data.
 * @param[in]  u32RdSize     Number of bytes to read.
 *
 * @return     None.
 */
void SPIM_IO_ReadByPhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable,
                         uint32_t u32Addr, uint8_t *pu8RxBuf, uint32_t u32RdSize)
{
    uint32_t u32DTREn = SPIM_GET_DTR_MODE(spim);
    uint32_t u32Is4ByteAddr = ((psPhaseTable->u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);
    uint32_t u32QuadMode = (((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
                             (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE)) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);

    /* Set Flash 4-Bytes Address Mode */
    SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));
    /* Set SPIM 4-Bytes Address Mode */
    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

    if (u32QuadMode)
    {
        SPIM_SetQuadEnable(spim, u32QuadMode, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));
    }

    /* send command, address, dummy, data */
    SPIM_IO_SendCommandByPhase(spim,
                               SPIM_IO_READ_PHASE,
                               psPhaseTable->u32CMDCode,
                               psPhaseTable->u32CMDPhase,
                               psPhaseTable->u32CMDDTR);

    SPIM_IO_SendAddressByPhase(spim,
                               u32Is4ByteAddr,
                               u32Addr,
                               psPhaseTable->u32AddrPhase,
                               psPhaseTable->u32AddrDTR);

    /* Write out dummy bytes. */
    SPIM_IO_SendDummyByPhase(spim, psPhaseTable->u32DcNum);

    SPIM_IO_RWDataByPhase(spim,
                          SPIM_IO_READ_PHASE,
                          pu8RxBuf,
                          u32RdSize,
                          psPhaseTable->u32DataPhase,
                          psPhaseTable->u32DataDTR,
                          psPhaseTable->u32RDQS);

    if (u32QuadMode)
    {
        SPIM_SetQuadEnable(spim, SPIM_OP_DISABLE, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));
    }

    SPIM_SET_DTR_MODE(spim, u32DTREn);
}

/**
 * @brief      Enable the SPIM DLL (Delay Locked Loop) circuit.
 *
 * @param[in]  spim      Pointer to the SPIM instance.
 *
 * @retval     SPIM_OK           DLL locked successfully.
 * @retval     SPIM_ERR_TIMEOUT  DLL lock failed due to timeout.
 *
 * @note       After a system wake-up or reset, this function must be called again
 *             to reinitialize the DLL.
 */
int32_t SPIM_INIT_DLL(SPIM_T *spim)
{
    volatile int i32TimeoutCount = (int32_t)SPIM_TIMEOUT;
    uint32_t u32BusClkHz = CLK_GetSCLKFreq() / (SPIM_GET_CLOCK_DIVIDER(spim) * 2);
    uint32_t u32ClkNs = 1000000000UL / u32BusClkHz;
    const uint32_t u32DllLockUs  = 20;
    const uint32_t u32DllValidUs = 50;
    const uint32_t u32DllClkOnUs = 20;
    const uint32_t u32DllTrimUs  = 20;
    uint32_t u32DelayCycleCount = 0;

    // Convert to cycles
    uint32_t u32DLLLKNUM = SPIM_CEIL_DIV((u32DllLockUs * SPIM_TRIM_MARGIN), u32ClkNs);
    uint32_t u32DLLOVNUM = SPIM_CEIL_DIV((u32DllValidUs * SPIM_TRIM_MARGIN), u32ClkNs);
    uint32_t u32CLKONNUM = SPIM_CEIL_DIV((u32DllClkOnUs * SPIM_TRIM_MARGIN), u32ClkNs);
    uint32_t u32TRIMNUM = SPIM_CEIL_DIV((u32DllTrimUs * SPIM_TRIM_MARGIN), u32ClkNs);

    uint32_t u32Div = (SPIM_GET_CLOCK_DIVIDER(spim) * 2);
    uint32_t u32FreqMHz = u32BusClkHz / 1000000;
    uint32_t u32FastEn = (u32FreqMHz <= 100) ? SPIM_OP_DISABLE : SPIM_OP_ENABLE;

    uint32_t u32DllDivCode = (u32Div <= 1) ? 0 : (u32Div == 2) ? 1 : (u32Div == 4) ? 2 : 3;
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    if (u32RegLockLevel) SYS_UnlockReg();

    // DLL timing setup
    SPIM_SET_DLLLOCK_NUM(spim, u32DLLLKNUM);
    SPIM_SET_DLLOV_NUM(spim, u32DLLOVNUM);
    SPIM_SET_DLLCLKON_NUM(spim, u32CLKONNUM);
    SPIM_SET_DLLTRIM_NUM(spim, u32TRIMNUM);

#if (SPIM_TRIM_HYPERDLL == 1)

    SPIM_ENABLE_SYSDLL0ATCTL0_TRIMUPDOFF();
#endif

    /* Set SPIM DLL clock divider */
    SPIM_SET_DLLDIV(spim, u32DllDivCode);

