OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    SPIM_SET_DLLFAST(spim, u32FastEn);

    /* SPIM starts to send DLL reference clock to DLL circuit
       that the frequency is the same as the SPIM output bus clock. */
    /* Enable SPIM DLL output */
    SPIM_ENABLE_DLLOLDO(spim, SPIM_OP_ENABLE);

#if (SPIM_TRIM_HYPERDLL == 1)
    SPIM_SET_AUTO_TRIM_DLL(spim, SPIM_OP_ENABLE);

    SPIM_SET_INTERNAL_RWDS(spim, SPIM_OP_ENABLE);
#endif

    /* User asserts this control register to 0x1,
       the DLL circuit begins searching for lock with DLL reference clock. */
    /* Assert SPIM DLL reset */
    SPIM_ENABLE_DLLOVRST(spim, SPIM_OP_ENABLE);

    /* Polling the DLL status register DLLCKON to 0x1,
       and the value 0x1 indicates that clock divider circuit inside DLL is enabled. */
    while (SPIM_GET_DLLOVRST(spim) == SPIM_OP_ENABLE)
        if (--i32TimeoutCount <= 0) break;

    i32TimeoutCount = (int32_t)SPIM_TIMEOUT;

    /* Polling the DLL status register DLLCKON to 0x1,
       and the value 0x1 indicates that clock divider circuit inside DLL is enabled. */
    while (SPIM_GET_DLLCLKON(spim) != SPIM_OP_ENABLE)
        if (--i32TimeoutCount <= 0) break;

    i32TimeoutCount = (int32_t)SPIM_TIMEOUT;

    /* Polling the DLL status register DLLLOCK to 0x1,
       and the value 0x1 indicates that DLL circuit is in lock state */
    while (SPIM_GET_DLLLOCK(spim) != SPIM_OP_ENABLE)
        if (--i32TimeoutCount <= 0) break;

    i32TimeoutCount = (int32_t)SPIM_TIMEOUT;

    /* Polling the DLL status register DLLREADY to 0x1,
       and the value 0x1 indicates that output of DLL circuit is ready. */
    while (SPIM_GET_DLLREADY(spim) != SPIM_OP_ENABLE)
        if (--i32TimeoutCount <= 0) break;

#if (SPIM_TRIM_HYPERDLL == 1)
    i32TimeoutCount = (int32_t)SPIM_TIMEOUT;

    /* Polling the DLL status register DLLREADY to 0x1,
    and the value 0x1 indicates that output of DLL circuit is ready. */
    while (SPIM_GET_DLLATRDY(spim) != SPIM_OP_ENABLE)
        if (--i32TimeoutCount <= 0) break;

    /* wait for auto trim setting */
    u32DelayCycleCount = (u32BusClkHz / 1000) * 3;  // 3ms = 3 * (Hz / 1000)

    for (i32TimeoutCount = 0; i32TimeoutCount < (int32_t)u32DelayCycleCount; i32TimeoutCount++)
        __NOP();

    SPIM_DISABLE_SYSDLL0ATCTL0_TRIMUPDOFF();

    SPIM_SET_INTERNAL_RWDS(spim, SPIM_OP_DISABLE);
#endif

    if (u32RegLockLevel) SYS_LockReg();

    return SPIM_OK;
}

/**
 * @brief      Set the DLL delay number and update the DLL_DNUM register.
 *
 * @param[in]  spim        Pointer to the SPIM instance.
 * @param[in]  u32DelayNum DLL delay number to set.
 *
 * @retval     SPIM_OK            Operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT   Operation aborted due to timeout.
 *
 * @note       Ensure the SPIM clock divider is configured before calling this function,
 *             as the delay depends on the SPIM output bus frequency.
 * @note       Returns SPIM_ERR_TIMEOUT if the Hyper chip does not respond in time.
 */
int32_t SPIM_SetDLLDelayNum(SPIM_T *spim, uint32_t u32DelayNum)
{
    volatile int i32TimeoutCount = (int32_t)SPIM_TIMEOUT;

    if (SPIM_GET_DLLOLDO(spim) != SPIM_OP_ENABLE)
    {
        SPIM_INIT_DLL(spim);
    }

    i32TimeoutCount = (int32_t)SPIM_TIMEOUT;

    /* Polling DLL status register DLL_REF to 1
       to know the updating flow of DLL delay step number is finish or not. */
    while (SPIM_GET_DLLREF(spim) != SPIM_OP_DISABLE)
        if (--i32TimeoutCount <= 0) break;

    /* Set this valid delay number to control register DLL_DNUM. */
    SPIM_SET_DLLDLY_NUM(spim, u32DelayNum);

    i32TimeoutCount = (int32_t)SPIM_TIMEOUT;

    /* Polling DLL status register DLL_REF to 1
       to know the updating flow of DLL delay step number is finish or not. */
    while (SPIM_GET_DLLREF(spim) != SPIM_OP_DISABLE)
        if (--i32TimeoutCount <= 0) break;

    return SPIM_OK;
}

/** @} end of group SPIM_EXPORTED_FUNCTIONS */
/** @} end of group SPIM_Driver */
/** @} end of group Standard_Driver */
